[
  {
    "0": "Child and Youth Studies",
    "1": "Child and Youth Studies",
    "2": null
  },
  {
    "0": "Chair  John McNamara  Professor Emeritus  Dorothy Griffiths  Professors  Maureen Connolly, Maurice Feldman, Jan Frijters, John McNamara, Richard Mitchell, Tom O'Neill, Frances Owen, Rebecca Raby, Tony Volk, Terrance J. Wade, Dawn Zinga  Associate Professors  Heather Chalmers, Voula Marinos, Danielle Molnar, Shannon Moore, Shauna Pomerantz, Christine Tardif-Williams, Donato Tarulli, Ayda Tekok-Kilic, Tricia Vause  Assistant Professors  Naomi Andrews, Dan Cui, Hannah Dyer, Erin Panda  Adjunct Professors  Miao Li, Heather Ramey, Hans Skott-Myhre  Department Co-ordinator  Alison Lahn  Administrative Co-ordinator  Carol Penner  Course Co-ordinator  Ellen Carter  Student Facilitator  Jo-Anne Sinnige-Egger  Student Learning Facilitator  Lindsay Cramp",
    "1": "Chair  John McNamara  Professor Emeritus  Dorothy Griffiths  Professors  Maureen Connolly, Maurice Feldman, Jan Frijters, John McNamara, Richard Mitchell, Tom O'Neill, Frances Owen, Rebecca Raby, Tony Volk, Terrance J. Wade, Dawn Zinga  Associate Professors  Heather Chalmers, Voula Marinos, Danielle Molnar, Shannon Moore, Shauna Pomerantz, Christine Tardif-Williams, Donato Tarulli, Ayda Tekok-Kilic, Tricia Vause  Assistant Professors  Naomi Andrews, Dan Cui, Hannah Dyer, Erin Panda  Adjunct Professors  Miao Li, Heather Ramey, Hans Skott-Myhre  Department Co-ordinator  Alison Lahn  Administrative Co-ordinator  Carol Penner  Course Co-ordinator  Ellen Carter  Student Facilitator  Jo-Anne Sinnige-Egger  Student Learning Facilitator  Lindsay Cramp",
    "2": null
  },
  {
    "0": "General Information",
    "1": "General Information",
    "2": null
  },
  {
    "0": "Administrative Assistant  Lora Baliukas  905-688-5550, extension 3740  Cairns 319  brocku.ca\/childandyouthstudies  The Department of Child and Youth Studies (CHYS) offers four-year programs leading to the BA Honours or BA with Major in Child and Youth Studies, a three-year BA Pass degree and a concurrent BA (Honours)\/BEd (Primary\/Junior) degree program. Child and Youth Studies programs provide a broadly based interdisciplinary approach that considers theoretical and applied approaches to children and youth within the multiple contexts of culture, the economy, the law, family, school, peer group, and community. With roots in psychology, sociology, anthropology, criminology, education and cultural studies, the academic focus provides an integration of approaches through which a comprehensive understanding of children and youth can evolve. In addition, the 20-credit degree programs give students the opportunity to prepare for admission to professional and advanced degree training in a variety of fields. Students interested in pursuing graduate study should complete the Honours degree.  The BA in Child and Youth Studies is not equivalent to an Early Childhood Education diploma and does not directly lead to certification as a preschool teacher. Many colleges offer fast-track Early Childhood Education programs designed for University graduates.  Brock students, both full-time and part-time, may apply to Child and Youth Studies. Applicants to major in BA CHYS (Single or Combined) or BA with Major must have credit in CHYS 1F90 and a minimum 60 percent major average in CHYS required courses completed as of May 1. All CHYS courses, GEOG 2P21, 3P21 and 3P22 (for combined CHYS\/GEOG majors), PSYC 2F23 (for combined CHYS\/LING and CHYS\/PSYC-PSYC focus majors), SOCI 2P00, 2P11 and 2P38 (for combined CHYS\/SOCI majors) will be used to calculate the CHYS average. Students who have other credits may be evaluated on an individual basis. Students failing to maintain the required average may request an opportunity to upgrade their marks and to be reinstated. Applicants to major in CHYS must submit a Child and Youth Studies departmental application form (available at brocku.ca\/chys) to the Child and Youth Studies office by May 1 in addition to the University Declare or Change Major Application form (available at brocku.ca\/registrar\/toolkit\/forms\/#changes-appeals). New applications to the Child and Youth Studies Honours, BA with Major and Pass BA programs are accepted in years 2 and 3. Late applications will not be accepted.  Brock students, both full-time and part-time, may apply to minor in Child and Youth Studies. Applicants to minor in CHYS must have credit in CHYS 1F90 and a minimum 60 percent minor average in CHYS required courses completed as of May 1. Applicants to minor in CHYS must submit a Child and Youth Studies departmental application form (available at brocku.ca\/chys) to the Child and Youth Studies office by May 1 in addition to the University Declare or Change Major Application form (available at brocku.ca\/registrar\/toolkit\/forms\/#changes-appeals). Late applications will not be accepted.  This is a limited enrolment program, and applicants to major or for Year 4 (Honours) must have the approval of the Chair of Child and Youth Studies. Admission is not guaranteed by attainment of the minimum requirements. Admission to Year 4 (Honours) is by application through the department. Students wishing to apply for the course work option are required to have a minimum 70 percent major average, a minimum 60 percent non-major average, a minimum 70 percent combined average in CHYS 3P10 and 3P15, and completion of fifteen credits which satisfy the requirements of the CHYS BA (Pass) (single or combined) degree requirements. Students wishing to apply for an individual thesis or applied research project are required to have a minimum 75 percent major average, a minimum 60 percent non-major average, a minimum 75 percent combined average in CHYS 3P10 and 3P15, and completion of fifteen credits which satisfy the requirements of the CHYS BA (Pass) (single or combined) degree requirements. Applicants for Honours Child and Youth Studies year 4 must submit a Child and Youth Studies departmental application form (available at brocku.ca\/chys) to the Child and Youth Studies office by May 1, in addition to the University Application for Year 4 Studies form (available at brocku.ca\/registrar\/wp-content\/uploads\/sites\/45\/ApptoYear4Studies.pdf). Students must apply to complete either a thesis, project or course work option for an Honours degree. Each Honours option will include a capstone experience. Late applications will not be accepted. Acceptance into the Individual Thesis and Applied Research Project streams may also be based in part on the availability of an approved supervisor from the CHYS department.  Students who have completed an appropriate College of Applied Arts and Technology two or three-year diploma must have a minimum 80 percent cumulative average for consideration by Child and Youth Studies for CHYS BA (single or combined) and may receive between three and five transfer credits if they are admitted to Brock. Child and Youth Studies evaluates the files of eligible students in consultation with the Registrar's Office after acceptance to Brock has been completed and transferable credits have been awarded. All applicants must take CHYS 1F90. It is recommended that CHYS BA (single or combined) majors seek academic advice (Appointments link in my.brocku.ca).  Students who have completed an appropriate College of Arts and Technology two-year diploma must have a minimum 80 percent cumulative average for consideration for the BA Child and Youth Studies (Honours)\/BEd Program and may receive a maximum of three transfer credits if they are admitted to Brock; students who have completed a Child and Youth Worker diploma may receive four transfer credits. All applicants must take CHYS 1F90. It is recommended that CHYS BA (Honours)\/BEd majors seek academic advice from the Concurrent Education Programs Office.",
    "1": "Administrative Assistant  Lora Baliukas  905-688-5550, extension 3740  Cairns 319  brocku.ca\/childandyouthstudies  The Department of Child and Youth Studies (CHYS) offers four-year programs leading to the BA Honours or BA with Major in Child and Youth Studies, a three-year BA Pass degree and a concurrent BA (Honours)\/BEd (Primary\/Junior) degree program. Child and Youth Studies programs provide a broadly based interdisciplinary approach that considers theoretical and applied approaches to children and youth within the multiple contexts of culture, the economy, the law, family, school, peer group, and community. With roots in psychology, sociology, anthropology, criminology, education and cultural studies, the academic focus provides an integration of approaches through which a comprehensive understanding of children and youth can evolve. In addition, the 20-credit degree programs give students the opportunity to prepare for admission to professional and advanced degree training in a variety of fields. Students interested in pursuing graduate study should complete the Honours degree.  The BA in Child and Youth Studies is not equivalent to an Early Childhood Education diploma and does not directly lead to certification as a preschool teacher. Many colleges offer fast-track Early Childhood Education programs designed for University graduates.  Brock students, both full-time and part-time, may apply to Child and Youth Studies. Applicants to major in BA CHYS (Single or Combined) or BA with Major must have credit in CHYS 1F90 and a minimum 60 percent major average in CHYS required courses completed as of May 1. All CHYS courses, GEOG 2P21, 3P21 and 3P22 (for combined CHYS\/GEOG majors), PSYC 2F23 (for combined CHYS\/LING and CHYS\/PSYC-PSYC focus majors), SOCI 2P00, 2P11 and 2P38 (for combined CHYS\/SOCI majors) will be used to calculate the CHYS average. Students who have other credits may be evaluated on an individual basis. Students failing to maintain the required average may request an opportunity to upgrade their marks and to be reinstated. Applicants to major in CHYS must submit a Child and Youth Studies departmental application form (available at brocku.ca\/chys) to the Child and Youth Studies office by May 1 in addition to the University Declare or Change Major Application form (available at brocku.ca\/registrar\/toolkit\/forms\/#changes-appeals). New applications to the Child and Youth Studies Honours, BA with Major and Pass BA programs are accepted in years 2 and 3. Late applications will not be accepted.  Brock students, both full-time and part-time, may apply to minor in Child and Youth Studies. Applicants to minor in CHYS must have credit in CHYS 1F90 and a minimum 60 percent minor average in CHYS required courses completed as of May 1. Applicants to minor in CHYS must submit a Child and Youth Studies departmental application form (available at brocku.ca\/chys) to the Child and Youth Studies office by May 1 in addition to the University Declare or Change Major Application form (available at brocku.ca\/registrar\/toolkit\/forms\/#changes-appeals). Late applications will not be accepted.  This is a limited enrolment program, and applicants to major or for Year 4 (Honours) must have the approval of the Chair of Child and Youth Studies. Admission is not guaranteed by attainment of the minimum requirements. Admission to Year 4 (Honours) is by application through the department. Students wishing to apply for the course work option are required to have a minimum 70 percent major average, a minimum 60 percent non-major average, a minimum 70 percent combined average in CHYS 3P10 and 3P15, and completion of fifteen credits which satisfy the requirements of the CHYS BA (Pass) (single or combined) degree requirements. Students wishing to apply for an individual thesis or applied research project are required to have a minimum 75 percent major average, a minimum 60 percent non-major average, a minimum 75 percent combined average in CHYS 3P10 and 3P15, and completion of fifteen credits which satisfy the requirements of the CHYS BA (Pass) (single or combined) degree requirements. Applicants for Honours Child and Youth Studies year 4 must submit a Child and Youth Studies departmental application form (available at brocku.ca\/chys) to the Child and Youth Studies office by May 1, in addition to the University Application for Year 4 Studies form (available at brocku.ca\/registrar\/wp-content\/uploads\/sites\/45\/ApptoYear4Studies.pdf). Students must apply to complete either a thesis, project or course work option for an Honours degree. Each Honours option will include a capstone experience. Late applications will not be accepted. Acceptance into the Individual Thesis and Applied Research Project streams may also be based in part on the availability of an approved supervisor from the CHYS department.  Students who have completed an appropriate College of Applied Arts and Technology two or three-year diploma must have a minimum 80 percent cumulative average for consideration by Child and Youth Studies for CHYS BA (single or combined) and may receive between three and five transfer credits if they are admitted to Brock. Child and Youth Studies evaluates the files of eligible students in consultation with the Registrar's Office after acceptance to Brock has been completed and transferable credits have been awarded. All applicants must take CHYS 1F90. It is recommended that CHYS BA (single or combined) majors seek academic advice (Appointments link in my.brocku.ca).  Students who have completed an appropriate College of Arts and Technology two-year diploma must have a minimum 80 percent cumulative average for consideration for the BA Child and Youth Studies (Honours)\/BEd Program and may receive a maximum of three transfer credits if they are admitted to Brock; students who have completed a Child and Youth Worker diploma may receive four transfer credits. All applicants must take CHYS 1F90. It is recommended that CHYS BA (Honours)\/BEd majors seek academic advice from the Concurrent Education Programs Office.",
    "2": null
  },
  {
    "0": "Teachable Subjects",
    "1": "Teachable Subjects",
    "2": null
  },
  {
    "0": "Students wishing to apply to teacher education programs in provinces other than Ontario are advised to check the admission requirements in the pertinent faculties of education with regard to teachable subjects. Students wishing to apply to teacher education programs in Ontario who do not take a minimum of three elective credits in courses designated as teachable subjects in one area may be restricted to certification at the Primary\/Junior level.",
    "1": "Students wishing to apply to teacher education programs in provinces other than Ontario are advised to check the admission requirements in the pertinent faculties of education with regard to teachable subjects. Students wishing to apply to teacher education programs in Ontario who do not take a minimum of three elective credits in courses designated as teachable subjects in one area may be restricted to certification at the Primary\/Junior level.",
    "2": null
  },
  {
    "0": "Concurrent CHYS BA (Honours)\/BEd (Primary\/Junior)",
    "1": "Concurrent CHYS BA (Honours)\/BEd (Primary\/Junior)",
    "2": null
  },
  {
    "0": "The Department of Child and Youth Studies and the Faculty of Education cooperate in offering a Concurrent BA (Honours)\/BEd program. The Child and Youth Studies BA (Honours)\/BEd program combines the BA Honours program with the teacher education program for students interested in teaching Primary\/Junior (grades K-6). Refer to the Education - Concurrent BA (Honours)\/BEd Child and Youth Studies Program listing for additional information.",
    "1": "The Department of Child and Youth Studies and the Faculty of Education cooperate in offering a Concurrent BA (Honours)\/BEd program. The Child and Youth Studies BA (Honours)\/BEd program combines the BA Honours program with the teacher education program for students interested in teaching Primary\/Junior (grades K-6). Refer to the Education - Concurrent BA (Honours)\/BEd Child and Youth Studies Program listing for additional information.",
    "2": null
  },
  {
    "0": "Program Notes",
    "1": "Program Notes",
    "2": null
  },
  {
    "0": "1. All Child and Youth Studies majors are encouraged to choose electives from other departments to broaden their academic experience. Students must take a minimum of one credit from courses based outside of Child and Youth Studies in each program year. If CHYS majors register in more than a combined total of two credits from CHYS Clusters A, B and C, they may be deregistered.  2. CHYS majors will require departmental approval to register in more than three and one-half CHYS credits until date specified in Registration guide.  3. Combined CHYS\/GEOG and CHYS\/SOCI majors who change to a single CHYS major will be required to take CHYS 2P51 and 2P52.  4. Applicants to major in BA CHYS (single or combined) or BA with Major must have credit in CHYS 1F90 and a minimum 60 per cent major average in CHYS required courses completed as of May 1.  5. Applicants to minor in CHYS must have credit in CHYS 1F90 and a minimum 60 per cent minor average in CHYS required courses completed as of May 1.  6. Admission to year 4 (Honours) is by application through the Department and applicants must have completed 15 credits which satisfy the CHYS BA (Pass) (single or combined) degree requirements. Students wishing to apply for the course work option are required to have a minimum 70 percent major average, a minimum 60 percent non-major average, and a minimum 70 percent combined average in CHYS 3P10 and 3P15. Students wishing to apply for an individual thesis or applied research project are required to have a minimum 75 percent major average, a minimum 60 percent non-major average, and a minimum 75 percent combined average in CHYS 3P10 and 3P15.  7. Admission to combined CHYS\/PSYC Year 4 (Honours) is by application through the Department. CHYS Focus requires a minimum 75 percent major average, a 75 percent combined average in CHYS 3P10 and 3P15, and a minimum 70 percent overall average. PSYC Focus requires a minimum 80 percent major average and a minimum 70 percent overall average.  8. PSYC 3F40 and 3P39 are restricted to students with a minimum 77 percent major average. PSYC 4F91 is restricted to students with a minimum 80 percent major average.  9. SOCI 4F90 is restricted to students with a minimum 80 percent major average.  10. CHYS and CHYS BA (Honours)\/BEd (Primary\/Junior) majors cannot take PSYC 2P12 or 3P18 in fulfilment of their degree requirements.  11. Students who opt to take CHYS 2P51 will be required to take CHYS 3P10 in Year 3. Students who opt to take CHYS 2P52 will be required to take CHYS 3P15 in Year 3.  12. Students must take one-half credit from two separate clusters.  13. In 20 credit Honours degree programs a maximum of eight credits may be numbered 1(alpha)00 to 1(alpha)99; at least three credits must be numbered 2(alpha)90 or above; at least three credits must be numbered 3(alpha)90 or above; and the remaining credits must be numbered 2(alpha)00 or above.In this 20 credit BA with Major degree programs a maximum of eight credits may be numbered 1(alpha)00 to 1(alpha)99; at least four and one-half credits must be numbered 2(alpha)90 or above and at least one and one-half credits must be numbered 3(alpha)90 or above; and the remaining credits must be numbered 2(alpha)00 or above.In 15 credit degree programs a maximum of eight credits may be numbered 1(alpha)00 to 1(alpha)99; at least three credits must be numbered 2(alpha)90 or above; and the remaining credits must be numbered 2(alpha)00 or above.In some circumstances, in order to meet university degree and program requirements, more than 15 or 20 credits may be taken.",
    "1": "1. All Child and Youth Studies majors are encouraged to choose electives from other departments to broaden their academic experience. Students must take a minimum of one credit from courses based outside of Child and Youth Studies in each program year. If CHYS majors register in more than a combined total of two credits from CHYS Clusters A, B and C, they may be deregistered.  2. CHYS majors will require departmental approval to register in more than three and one-half CHYS credits until date specified in Registration guide.  3. Combined CHYS\/GEOG and CHYS\/SOCI majors who change to a single CHYS major will be required to take CHYS 2P51 and 2P52.  4. Applicants to major in BA CHYS (single or combined) or BA with Major must have credit in CHYS 1F90 and a minimum 60 per cent major average in CHYS required courses completed as of May 1.  5. Applicants to minor in CHYS must have credit in CHYS 1F90 and a minimum 60 per cent minor average in CHYS required courses completed as of May 1.  6. Admission to year 4 (Honours) is by application through the Department and applicants must have completed 15 credits which satisfy the CHYS BA (Pass) (single or combined) degree requirements. Students wishing to apply for the course work option are required to have a minimum 70 percent major average, a minimum 60 percent non-major average, and a minimum 70 percent combined average in CHYS 3P10 and 3P15. Students wishing to apply for an individual thesis or applied research project are required to have a minimum 75 percent major average, a minimum 60 percent non-major average, and a minimum 75 percent combined average in CHYS 3P10 and 3P15.  7. Admission to combined CHYS\/PSYC Year 4 (Honours) is by application through the Department. CHYS Focus requires a minimum 75 percent major average, a 75 percent combined average in CHYS 3P10 and 3P15, and a minimum 70 percent overall average. PSYC Focus requires a minimum 80 percent major average and a minimum 70 percent overall average.  8. PSYC 3F40 and 3P39 are restricted to students with a minimum 77 percent major average. PSYC 4F91 is restricted to students with a minimum 80 percent major average.  9. SOCI 4F90 is restricted to students with a minimum 80 percent major average.  10. CHYS and CHYS BA (Honours)\/BEd (Primary\/Junior) majors cannot take PSYC 2P12 or 3P18 in fulfilment of their degree requirements.  11. Students who opt to take CHYS 2P51 will be required to take CHYS 3P10 in Year 3. Students who opt to take CHYS 2P52 will be required to take CHYS 3P15 in Year 3.  12. Students must take one-half credit from two separate clusters.  13. In 20 credit Honours degree programs a maximum of eight credits may be numbered 1(alpha)00 to 1(alpha)99; at least three credits must be numbered 2(alpha)90 or above; at least three credits must be numbered 3(alpha)90 or above; and the remaining credits must be numbered 2(alpha)00 or above.In this 20 credit BA with Major degree programs a maximum of eight credits may be numbered 1(alpha)00 to 1(alpha)99; at least four and one-half credits must be numbered 2(alpha)90 or above and at least one and one-half credits must be numbered 3(alpha)90 or above; and the remaining credits must be numbered 2(alpha)00 or above.In 15 credit degree programs a maximum of eight credits may be numbered 1(alpha)00 to 1(alpha)99; at least three credits must be numbered 2(alpha)90 or above; and the remaining credits must be numbered 2(alpha)00 or above.In some circumstances, in order to meet university degree and program requirements, more than 15 or 20 credits may be taken.",
    "2": null
  },
  {
    "0": "Course Clusters",
    "1": "Course Clusters",
    "2": null
  },
  {
    "0": "Required courses offered by the Department in Year 3 fall into three main clusters:  Cluster A  CHYS 3P09, 3P11, 3P12, 3P23, 3P24, 3P36, 3P65, 3P74  Cluster B  CHYS 3P20, 3P26, 3P35, 3P43, 3P47, 3P60, 3V55  Cluster C  CHYS 3P27, 3P28, 3P30, 3P31, 3P32, 3P38, 3P39, 3P44",
    "1": "Required courses offered by the Department in Year 3 fall into three main clusters:  Cluster A  CHYS 3P09, 3P11, 3P12, 3P23, 3P24, 3P36, 3P65, 3P74  Cluster B  CHYS 3P20, 3P26, 3P35, 3P43, 3P47, 3P60, 3V55  Cluster C  CHYS 3P27, 3P28, 3P30, 3P31, 3P32, 3P38, 3P39, 3P44",
    "2": null
  },
  {
    "0": "Honours Program",
    "1": "Honours Program",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit or Sciences context credit  one elective credit  Year 2  CHYS 2P10,2P35, 2P38, 2P51 and 2P52  CHYS 2F15 or 2F16  the Humanities context credit or Sciences context credit (not taken in year 1)  one-half elective credit (see program note 10)  Year 3  CHYS 3P10 and 3P15  one-half CHYS credit from Cluster A  one-half CHYS credit from Cluster B  one-half CHYS credit from Cluster C  two and one-half elective credits (see program notes 1, 2, 10 and 13)  Year 4  Depending upon the major average and other departmental requirements, students may select one of three options:  Individual Thesis option:  CHYS 4F99 and 4P70 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  one-half CHYS credit numbered 4(alpha)00 or above  two elective credits (see program notes 1, 2, 10 and 13)  Applied Research Project option:  CHYS 4F95 and 4P70 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  one-half CHYS credit numbered 4(alpha)00 or above  two elective credits (see program notes 1, 2, 10 and 13)  Course Work option:  CHYS 4F80 (see program note 6)  one CHYS credit numbered 3(alpha)90 to 4(alpha)99  one CHYS credit numbered 4(alpha)00 to 4(alpha)99  two elective credits (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit or Sciences context credit  one elective credit  Year 2  CHYS 2P10,2P35, 2P38, 2P51 and 2P52  CHYS 2F15 or 2F16  the Humanities context credit or Sciences context credit (not taken in year 1)  one-half elective credit (see program note 10)  Year 3  CHYS 3P10 and 3P15  one-half CHYS credit from Cluster A  one-half CHYS credit from Cluster B  one-half CHYS credit from Cluster C  two and one-half elective credits (see program notes 1, 2, 10 and 13)  Year 4  Depending upon the major average and other departmental requirements, students may select one of three options:  Individual Thesis option:  CHYS 4F99 and 4P70 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  one-half CHYS credit numbered 4(alpha)00 or above  two elective credits (see program notes 1, 2, 10 and 13)  Applied Research Project option:  CHYS 4F95 and 4P70 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  one-half CHYS credit numbered 4(alpha)00 or above  two elective credits (see program notes 1, 2, 10 and 13)  Course Work option:  CHYS 4F80 (see program note 6)  one CHYS credit numbered 3(alpha)90 to 4(alpha)99  one CHYS credit numbered 4(alpha)00 to 4(alpha)99  two elective credits (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "Child and Youth Studies BA with Major",
    "1": "Child and Youth Studies BA with Major",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit or Sciences context credit  one elective credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52  CHYS 2F15 or 2F16  the Humanities context credit or Sciences context credit (not taken in year 1)  one-half elective credit (see program note 10)  Year 3  CHYS 3P10 and 3P15  one-half CHYS credit from Cluster A  one-half CHYS credit from Cluster B  one-half CHYS credit from Cluster C  two and one-half elective credits (see program notes 1, 2, 10 and 13)  Year 4  One and one-half CHYS credits numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one-half CHYS credit numbered 3(alpha)90 or above  two elective credits (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit or Sciences context credit  one elective credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52  CHYS 2F15 or 2F16  the Humanities context credit or Sciences context credit (not taken in year 1)  one-half elective credit (see program note 10)  Year 3  CHYS 3P10 and 3P15  one-half CHYS credit from Cluster A  one-half CHYS credit from Cluster B  one-half CHYS credit from Cluster C  two and one-half elective credits (see program notes 1, 2, 10 and 13)  Year 4  One and one-half CHYS credits numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one-half CHYS credit numbered 3(alpha)90 or above  two elective credits (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "Pass Program",
    "1": "Pass Program",
    "2": null
  },
  {
    "0": "Satisfactory completion of the first three years of the Honours program entitles a student to apply for a Pass degree.",
    "1": "Satisfactory completion of the first three years of the Honours program entitles a student to apply for a Pass degree.",
    "2": null
  },
  {
    "0": "Combined Major Program",
    "1": "Combined Major Program",
    "2": null
  },
  {
    "0": "Students may take a combined degree in Child and Youth Studies and another discipline. For requirements in the co-major discipline the student should consult the relevant department. It should be noted that not all departments provide a combined major option.",
    "1": "Students may take a combined degree in Child and Youth Studies and another discipline. For requirements in the co-major discipline the student should consult the relevant department. It should be noted that not all departments provide a combined major option.",
    "2": null
  },
  {
    "0": "Child and Youth Studies and Applied Linguistics",
    "1": "Child and Youth Studies and Applied Linguistics",
    "2": null
  },
  {
    "0": "Consult the Applied Linguistics entry for a listing of program requirements.",
    "1": "Consult the Applied Linguistics entry for a listing of program requirements.",
    "2": null
  },
  {
    "0": "Child and Youth Studies and Geography",
    "1": "Child and Youth Studies and Geography",
    "2": null
  },
  {
    "0": "Honours  Year 1  CHYS 1F90  GEOG 1F90  PSYC 1F90  SOCI 1F90  one Sciences context credit  Year 2  CHYS 2P10, 2P35 and 2P38  CHYS 2F15 or 2F16  CHYS 2P51 or 2P52 (see program notes 3 and 11)  GEOG 2P21  one and one-half credits from GEOG 2P01, 2P03, 2P06, 2P07, 2P13, 2P30, 2P33, 2P66, 2P94  Year 3  CHYS 3P10 and GEOG 3P22, or CHYS 3P15 and GEOG 3P21  one CHYS credit from Cluster A, B or C (see program note 12)  GEOG 3P57  one and one-half GEOG credits numbered 2(alpha)90 to 3(alpha)89 from group A, C or D (see Geography department)  one Humanities context credit  Year 4  Students may select one of three options:  Individual Thesis option:  CHYS 4F99 and 4P70 (see program note 6)  one-half CHYS credit numbered 3(alpha)90 or above  one-half CHYS credit numbered 4(alpha)00 or above  GEOG 4F99  one GEOG credit numbered 3(alpha)90 or above from group A, C or D (see Geography department)  one-half elective credit (see program notes 1, 2, 10 and 13)  Applied Research Project option:  CHYS 4F95 and 4P70 (see program note 6)  one-half CHYS credit numbered 3(alpha)90 or above  one-half CHYS credit numbered 4(alpha)00 or above  GEOG 4F99  one GEOG credit numbered 3(alpha)90 or above from group A, C or D (see Geography department)  one-half elective credit (see program notes 1, 2, 10 and 13)  Course Work option:  CHYS 4F80 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  GEOG 4F99  one GEOG credit numbered 3(alpha)90 or above from group A, C or D (see Geography department)  one elective credit (see program notes 1, 2, 10 and 13)  Pass  Satisfactory completion of the first three years of the Honours program entitles a student to apply for a Pass degree.",
    "1": "Honours  Year 1  CHYS 1F90  GEOG 1F90  PSYC 1F90  SOCI 1F90  one Sciences context credit  Year 2  CHYS 2P10, 2P35 and 2P38  CHYS 2F15 or 2F16  CHYS 2P51 or 2P52 (see program notes 3 and 11)  GEOG 2P21  one and one-half credits from GEOG 2P01, 2P03, 2P06, 2P07, 2P13, 2P30, 2P33, 2P66, 2P94  Year 3  CHYS 3P10 and GEOG 3P22, or CHYS 3P15 and GEOG 3P21  one CHYS credit from Cluster A, B or C (see program note 12)  GEOG 3P57  one and one-half GEOG credits numbered 2(alpha)90 to 3(alpha)89 from group A, C or D (see Geography department)  one Humanities context credit  Year 4  Students may select one of three options:  Individual Thesis option:  CHYS 4F99 and 4P70 (see program note 6)  one-half CHYS credit numbered 3(alpha)90 or above  one-half CHYS credit numbered 4(alpha)00 or above  GEOG 4F99  one GEOG credit numbered 3(alpha)90 or above from group A, C or D (see Geography department)  one-half elective credit (see program notes 1, 2, 10 and 13)  Applied Research Project option:  CHYS 4F95 and 4P70 (see program note 6)  one-half CHYS credit numbered 3(alpha)90 or above  one-half CHYS credit numbered 4(alpha)00 or above  GEOG 4F99  one GEOG credit numbered 3(alpha)90 or above from group A, C or D (see Geography department)  one-half elective credit (see program notes 1, 2, 10 and 13)  Course Work option:  CHYS 4F80 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  GEOG 4F99  one GEOG credit numbered 3(alpha)90 or above from group A, C or D (see Geography department)  one elective credit (see program notes 1, 2, 10 and 13)  Pass  Satisfactory completion of the first three years of the Honours program entitles a student to apply for a Pass degree.",
    "2": null
  },
  {
    "0": "Child and Youth Studies and Psychology",
    "1": "Child and Youth Studies and Psychology",
    "2": null
  },
  {
    "0": "Honours  This is a specialized Combined Honours program that has students choosing to focus on either Child and Youth Studies or Psychology upon entry to Year 2.",
    "1": "Honours  This is a specialized Combined Honours program that has students choosing to focus on either Child and Youth Studies or Psychology upon entry to Year 2.",
    "2": null
  },
  {
    "0": "For Child and Youth Studies Focus:",
    "1": "For Child and Youth Studies Focus:",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52  CHYS 2F15 or 2F16  two PSYC credits numbered 2(alpha)00 to 2(alpha)99  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B or C (see program note 12)  two PSYC credits numbered 3(alpha)00 to 3(alpha)99  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  Students may select one of two options:  Individual Thesis option:  CHYS 4F99 and 4P70 (see program notes 6 and 7)  one CHYS credit numbered 3(alpha)90 or above  two PSYC credits numbered 3(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)  Applied Research Project option:  CHYS 4F95 and 4P70 (see program notes 6 and 7)  one CHYS credit numbered 3(alpha)90 or above  two PSYC credits numbered 3(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52  CHYS 2F15 or 2F16  two PSYC credits numbered 2(alpha)00 to 2(alpha)99  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B or C (see program note 12)  two PSYC credits numbered 3(alpha)00 to 3(alpha)99  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  Students may select one of two options:  Individual Thesis option:  CHYS 4F99 and 4P70 (see program notes 6 and 7)  one CHYS credit numbered 3(alpha)90 or above  two PSYC credits numbered 3(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)  Applied Research Project option:  CHYS 4F95 and 4P70 (see program notes 6 and 7)  one CHYS credit numbered 3(alpha)90 or above  two PSYC credits numbered 3(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "For Psychology Focus:",
    "1": "For Psychology Focus:",
    "2": null
  },
  {
    "0": "Year 1  PSYC 1F90  CHYS 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  PSYC 2F23  one and one-half PSYC credits numbered 2(alpha)00 to 2(alpha)99  CHYS 2P10, 2P35, 2P38 and 2P51  CHYS 2F15 or 2F16  Year 3  PSYC 3F40 and 3P39 (see program note 8)  one PSYC credit numbered 3(alpha)00 to 3(alpha)99  CHYS 3P10  one CHYS credit from Cluster A, B, or C (see program note 11)  one-half CHYS credit numbered 3(alpha)00 to 3(alpha)99  Year 4  PSYC 4F91, 4P92 and 4P93 (see program notes 6, 7 and 8)  one PSYC credit numbered 3(alpha)90 or above  one CHYS credit numbered 3(alpha)90 or above  one CHYS credit numbered 4(alpha)00 or above  Pass  Satisfactory completion of the first three years of the Honours program entitles a student to apply for a Pass degree.",
    "1": "Year 1  PSYC 1F90  CHYS 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  PSYC 2F23  one and one-half PSYC credits numbered 2(alpha)00 to 2(alpha)99  CHYS 2P10, 2P35, 2P38 and 2P51  CHYS 2F15 or 2F16  Year 3  PSYC 3F40 and 3P39 (see program note 8)  one PSYC credit numbered 3(alpha)00 to 3(alpha)99  CHYS 3P10  one CHYS credit from Cluster A, B, or C (see program note 11)  one-half CHYS credit numbered 3(alpha)00 to 3(alpha)99  Year 4  PSYC 4F91, 4P92 and 4P93 (see program notes 6, 7 and 8)  one PSYC credit numbered 3(alpha)90 or above  one CHYS credit numbered 3(alpha)90 or above  one CHYS credit numbered 4(alpha)00 or above  Pass  Satisfactory completion of the first three years of the Honours program entitles a student to apply for a Pass degree.",
    "2": null
  },
  {
    "0": "Child and Youth Studies and Sociology",
    "1": "Child and Youth Studies and Sociology",
    "2": null
  },
  {
    "0": "Honours  This is a specialized Combined Honours program that has students choosing to focus on either Child and Youth Studies or Sociology upon entry to Year 2.",
    "1": "Honours  This is a specialized Combined Honours program that has students choosing to focus on either Child and Youth Studies or Sociology upon entry to Year 2.",
    "2": null
  },
  {
    "0": "For Child and Youth Studies Focus (Honours):",
    "1": "For Child and Youth Studies Focus (Honours):",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52 (see program note 3)  CHYS 2F15 or 2F16  SOCI 2P00  one and one-half SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B, or C (see program note 12)  SOCI 3P00 or 3P01  one and one-half SOCI credits numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  Students may select one of three options:  Individual Thesis option:  CHYS 4F99 and 4P70 (see program note 6)  one-half CHYS credit numbered 3(alpha)90 or above  SOCI 4P38  one and one-half SOCI credits numbered 3(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)  Applied Research Project option:  CHYS 4F95 and 4P70 (see program note 6)  one-half CHYS credit numbered 3(alpha)90 or above  SOCI 4P38  one and one-half SOCI credits numbered 3(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)  Course Work option:  CHYS 4F80 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  two SOCI credits numbered 3(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52 (see program note 3)  CHYS 2F15 or 2F16  SOCI 2P00  one and one-half SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B, or C (see program note 12)  SOCI 3P00 or 3P01  one and one-half SOCI credits numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  Students may select one of three options:  Individual Thesis option:  CHYS 4F99 and 4P70 (see program note 6)  one-half CHYS credit numbered 3(alpha)90 or above  SOCI 4P38  one and one-half SOCI credits numbered 3(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)  Applied Research Project option:  CHYS 4F95 and 4P70 (see program note 6)  one-half CHYS credit numbered 3(alpha)90 or above  SOCI 4P38  one and one-half SOCI credits numbered 3(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)  Course Work option:  CHYS 4F80 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  two SOCI credits numbered 3(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "For Child and Youth Studies Focus (Pass):",
    "1": "For Child and Youth Studies Focus (Pass):",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52 (see program note 3)  CHYS 2F15 or 2F16  SOCI 2P00  one and one-half SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B, or C (see program note 12)  SOCI 3P00 or 3P01  one and one-half SOCI credits numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52 (see program note 3)  CHYS 2F15 or 2F16  SOCI 2P00  one and one-half SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B, or C (see program note 12)  SOCI 3P00 or 3P01  one and one-half SOCI credits numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "For Sociology Focus (Honours):",
    "1": "For Sociology Focus (Honours):",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35 and 2P38  CHYS 2F15 or 2F16  SOCI 2P00 and 2P11 (see program note 3)  two SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10  one CHYS credit from Cluster A, B, or C (see program note 12)  one-half CHYS credit numbered 3(alpha)00 to 3(alpha)99  SOCI 3P00 or 3P01  SOCI 3P02 or 3P12  SOCI 3P11  one-half SOCI credit numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  Students may select one of two options:  Thesis option:  CHYS 4P38  one-half CHYS credit numbered 3(alpha)90 or above  one CHYS credit numbered 4(alpha)00 or above  SOCI 4F01 and 4F90 (see program note 9)  one elective credit (see program notes 1, 2, 10 and 13)  Course Work option:  CHYS 4F80 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  two SOCI credits numbered 3(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35 and 2P38  CHYS 2F15 or 2F16  SOCI 2P00 and 2P11 (see program note 3)  two SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10  one CHYS credit from Cluster A, B, or C (see program note 12)  one-half CHYS credit numbered 3(alpha)00 to 3(alpha)99  SOCI 3P00 or 3P01  SOCI 3P02 or 3P12  SOCI 3P11  one-half SOCI credit numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  Students may select one of two options:  Thesis option:  CHYS 4P38  one-half CHYS credit numbered 3(alpha)90 or above  one CHYS credit numbered 4(alpha)00 or above  SOCI 4F01 and 4F90 (see program note 9)  one elective credit (see program notes 1, 2, 10 and 13)  Course Work option:  CHYS 4F80 (see program note 6)  one CHYS credit numbered 3(alpha)90 or above  two SOCI credits numbered 3(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "For Sociology Focus (Pass):",
    "1": "For Sociology Focus (Pass):",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35 and 2P38  CHYS 2F15 or 2F16  SOCI 2P00 and 2P11 (see program note 3)  two SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10  one CHYS credit from Cluster A, B, or C (see program note 12)  one-half CHYS credit numbered 3(alpha)00 to 3(alpha)99  SOCI 3P00 or 3P01  SOCI 3P11  one SOCI credit numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35 and 2P38  CHYS 2F15 or 2F16  SOCI 2P00 and 2P11 (see program note 3)  two SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10  one CHYS credit from Cluster A, B, or C (see program note 12)  one-half CHYS credit numbered 3(alpha)00 to 3(alpha)99  SOCI 3P00 or 3P01  SOCI 3P11  one SOCI credit numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "BA with Major",
    "1": "BA with Major",
    "2": null
  },
  {
    "0": "Child and Youth Studies and Psychology",
    "1": "Child and Youth Studies and Psychology",
    "2": null
  },
  {
    "0": "For Child and Youth Studies Focus:",
    "1": "For Child and Youth Studies Focus:",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52  CHYS 2F15 or 2F16  two PSYC credits numbered 2(alpha)00 to 2(alpha)99  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B or C (see program note 12)  two PSYC credits numbered 3(alpha)00 to 3(alpha)99  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  One CHYS credit numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one PSYC credit numbered 3(alpha)00 to 4(alpha)99  one PSYC credit numbered 3(alpha)90 to 4(alpha)99  one elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52  CHYS 2F15 or 2F16  two PSYC credits numbered 2(alpha)00 to 2(alpha)99  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B or C (see program note 12)  two PSYC credits numbered 3(alpha)00 to 3(alpha)99  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  One CHYS credit numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one PSYC credit numbered 3(alpha)00 to 4(alpha)99  one PSYC credit numbered 3(alpha)90 to 4(alpha)99  one elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "For Psychology Focus:",
    "1": "For Psychology Focus:",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38 and 2P51  CHYS 2F15 or 2F16  PSYC 2F23  one and one-half PSYC credits numbered 2(alpha)00 to 2(alpha)99  Year 3  CHYS 3P10  one CHYS credit from Cluster A, B or C (see program note 12)  one-half CHYS credit numbered 3(alpha)00 to 3(alpha)89  PSYC 3F40 and 3P39, or PSYC 3P30 and one PSYC credit numbered 3(alpha)00 to 3(alpha)99 (see program note 8)  one PSYC credit numbered 3(alpha)00 to 3(alpha)99  Year 4  One CHYS credit numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one PSYC credit numbered 3(alpha)00 to 4(alpha)99  one PSYC credit numbered 3(alpha)90 to 4(alpha)99  one elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38 and 2P51  CHYS 2F15 or 2F16  PSYC 2F23  one and one-half PSYC credits numbered 2(alpha)00 to 2(alpha)99  Year 3  CHYS 3P10  one CHYS credit from Cluster A, B or C (see program note 12)  one-half CHYS credit numbered 3(alpha)00 to 3(alpha)89  PSYC 3F40 and 3P39, or PSYC 3P30 and one PSYC credit numbered 3(alpha)00 to 3(alpha)99 (see program note 8)  one PSYC credit numbered 3(alpha)00 to 3(alpha)99  Year 4  One CHYS credit numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one PSYC credit numbered 3(alpha)00 to 4(alpha)99  one PSYC credit numbered 3(alpha)90 to 4(alpha)99  one elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "Child and Youth Studies and Sociology",
    "1": "Child and Youth Studies and Sociology",
    "2": null
  },
  {
    "0": "For Child and Youth Studies Focus:",
    "1": "For Child and Youth Studies Focus:",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52 (see program note 3)  CHYS 2F15 or 2F16  SOCI 2P00  one and one-half SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B, or C (see program note 12)  SOCI 3P00 or 3P01  one and one-half SOCI credits numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  One CHYS credit numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one SOCI credit numbered 2(alpha)90 to 3(alpha)99  one SOCI credit numbered 3(alpha)90 to 3(alpha)99  one elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35, 2P38, 2P51 and 2P52 (see program note 3)  CHYS 2F15 or 2F16  SOCI 2P00  one and one-half SOCI credits numbered 2(alpha)00 or above  Year 3  CHYS 3P10 and 3P15  one CHYS credit from Cluster A, B, or C (see program note 12)  SOCI 3P00 or 3P01  one and one-half SOCI credits numbered 2(alpha)90 or above  one-half elective credit (see program notes 1, 2, 10 and 13)  Year 4  One CHYS credit numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one SOCI credit numbered 2(alpha)90 to 3(alpha)99  one SOCI credit numbered 3(alpha)90 to 3(alpha)99  one elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "For Sociology Focus:",
    "1": "For Sociology Focus:",
    "2": null
  },
  {
    "0": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35 and 2P38  CHYS 2F15 or 2F16  SOCI 2P00 and 2P11 (see program note 3)  one SOCI credit numbered 2(alpha)00 or above  one-half elective credit (see program note 10)  Year 3  CHYS 3P10  one CHYS credit from Cluster A, B or C (see program note 12)  one-half CHYS credits numbered 2(alpha)00 to 3(alpha)89  SOCI 3P00 or 3P01  SOCI 3P11  one SOCI credit numbered 2(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)  Year 4  One CHYS credit numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one SOCI credit numbered 2(alpha)90 to 3(alpha)99  one SOCI credit numbered 3(alpha)90 to 3(alpha)99  one elective credit (see program notes 1, 2, 10 and 13)",
    "1": "Year 1  CHYS 1F90  PSYC 1F90  SOCI 1F90  one Humanities context credit  one Sciences context credit  Year 2  CHYS 2P10, 2P35 and 2P38  CHYS 2F15 or 2F16  SOCI 2P00 and 2P11 (see program note 3)  one SOCI credit numbered 2(alpha)00 or above  one-half elective credit (see program note 10)  Year 3  CHYS 3P10  one CHYS credit from Cluster A, B or C (see program note 12)  one-half CHYS credits numbered 2(alpha)00 to 3(alpha)89  SOCI 3P00 or 3P01  SOCI 3P11  one SOCI credit numbered 2(alpha)90 or above  one elective credit (see program notes 1, 2, 10 and 13)  Year 4  One CHYS credit numbered 3(alpha)00 to 3(alpha)89  one CHYS credit numbered 3(alpha)90 to 3(alpha)99  one SOCI credit numbered 2(alpha)90 to 3(alpha)99  one SOCI credit numbered 3(alpha)90 to 3(alpha)99  one elective credit (see program notes 1, 2, 10 and 13)",
    "2": null
  },
  {
    "0": "Minor in Child and Youth Studies",
    "1": "Minor in Child and Youth Studies",
    "2": null
  },
  {
    "0": "Students in other disciplines can obtain a minor in Child and Youth Studies within their degree program by completing the following courses with a minimum 60 percent overall average:  CHYS 1F90, 2P10, 2P35 and 2P38  one of CHYS 3P09, 3P11, 3P12, 3P24, 3P36, 3P65, 3P74  one of CHYS 3P20, 3P26, 3P35, 3P43, 3P47, 3P60, 3V55  one of CHYS 3P27, 3P28, 3P30, 3P31, 3P32, 3P38, 3P39, 3P44",
    "1": "Students in other disciplines can obtain a minor in Child and Youth Studies within their degree program by completing the following courses with a minimum 60 percent overall average:  CHYS 1F90, 2P10, 2P35 and 2P38  one of CHYS 3P09, 3P11, 3P12, 3P24, 3P36, 3P65, 3P74  one of CHYS 3P20, 3P26, 3P35, 3P43, 3P47, 3P60, 3V55  one of CHYS 3P27, 3P28, 3P30, 3P31, 3P32, 3P38, 3P39, 3P44",
    "2": null
  },
  {
    "0": "Graduate (MA) Program",
    "1": "Graduate (MA) Program",
    "2": null
  },
  {
    "0": "The MA program offers a unique multidisciplinary approach to the study of children and youth, providing a theoretical foundation and the application of social science research methods through the completion of a research-based thesis.",
    "1": "The MA program offers a unique multidisciplinary approach to the study of children and youth, providing a theoretical foundation and the application of social science research methods through the completion of a research-based thesis.",
    "2": null
  },
  {
    "0": "Course Descriptions",
    "1": "Course Descriptions",
    "2": null
  },
  {
    "0": "Note that not all courses are offered in every session. Refer to the applicable term timetable for details.  # Indicates a cross listed course  * Indicates a primary offering of a cross listed course",
    "1": "Note that not all courses are offered in every session. Refer to the applicable term timetable for details.  # Indicates a cross listed course  * Indicates a primary offering of a cross listed course",
    "2": null
  },
  {
    "0": "Prerequisites and Restrictions",
    "1": "Prerequisites and Restrictions",
    "2": null
  },
  {
    "0": "Students must check to ensure that prerequisites are met. Students may be deregistered, at the request of the instructor, from any course for which prerequisites and\/or restrictions have not been met.  CHYS 1F90  Introduction to Child and Youth Studies  Theories, methods and issues involved in studying children and youth from a multidisciplinary perspective. Topics may include the history of childhood, family life, peer relations and children and youth with special needs.  Lectures, seminar, 3 hours per week.  Restriction: open to students admitted to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/IntermediaA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate), Bte), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate) and CHYS minors until date specified in Registration guide. In Spring session open to all students.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 1F95.  CHYS 1F95  Child and Youth Studies in Indigenous Contexts  Theories, methods and issues involved in studying children and youth from a multidisciplinary perspective. Topics may include the developmental psychology, history of childhood, family life, peer relations and children and youth with special needs within an Indigenous education context.  Lectures, seminar, 72 contact hours.  Restriction: open to BEd-Primary\/Junior (Aboriginal) majors.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 1F90.  CHYS 1M90-1M99  Special Topics  Topic will vary depending on the needs of the program and availability of a faculty instructor.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA(Honours)\/BEd (Primary\/Junior) majors.  CHYS 2F05  Development in Indigenous Contexts  Basic concepts and contemporary issues in the development of the child and youth focusing on Indigenous contexts. Topics may include processes in cognitive and social-emotional patterns of change, education and development, diversity within development and alternative theories. Developmental theory and research provides the conceptual framework focusing on Indigenous contexts.  Lectures, seminar, 72 contact hours.  Restriction: open to BEd-Primary\/Junior (Aboriginal) majors.  Prerequisite(s): CHYS 1F95 (1M95).  Note: students may not concurrently register in CHYS 2P10 or PSYC 2P12. This course will draw upon relevant work or volunteer experience. Students must have completed 60 hours of work or volunteer experience within education or community-based settings that serve children and youth prior to enrolling in the course.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2M01, CHYS 2P10 and PSYC 2P12.  CHYS 2F15  Principles of Service-Learning in Child and Youth Studies  Applying service-learning theories and principles within a community\/educational setting and examining the service experience within multidisciplinary perspectives.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 60 percent overall average and permission of the Department.  Prerequisite(s): CHYS 1F90.  Corequisite(s): one of CHYS 2P10, 2P35, 2P38.  Note: offered online. Course enrolment is limited. Completion of a service-learning component is required by all students. Transportation to the setting is a student responsibility. Students will be required to make arrangements for a police record check with a vulnerable sector screening. Students must submit an application to the appropriate police service, not earlier than May 1, and assure police check is received by the Department not later than July 15. Permission for course registration will not be granted until the satisfactory police record check with a vulnerable sector screening is received by the department. Cost associated with the police record check is a student responsibility. Students may also be required to complete mandatory training (i.e., Health and Safety, AODA). This course is designed to promote the bridging of disciplines. Failure to submit the completed, signed Service Learning Verification form (Attendance Record) for the successful community or school setting, or failure to complete the on-line course component, will result in a grade of F for the course.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F16, 2P15 or 2P16.  CHYS 2F16  Principles of Community Engagement in Child and Youth Studies  Multidisciplinary exploration of concepts, practices, and implications of engagement in community and educational settings. Includes reflection on and discussion of young people\u0092s experiences within diverse contexts and relationships, as conveyed through observational video resources and presentations by community-based guest speakers.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors.  Prerequisite(s): CHYS 1F90.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F15, 2P15 or 2P16.  CHYS 2M00-2M10  Special Topics  Topic will vary depending on the needs of the program and availability of a faculty instructor.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors.  CHYS 2P10  Child and Youth Development  Basic concepts and contemporary issues in the development of the child and youth, including processes in cognitive and social-emotional patterns of change. Developmental theory and research provides the conceptual framework.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/IntermediaA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate), Bte), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide.  Prerequisite(s): CHYS 1F90 or 1F95.  Note: students may not concurrently register in PSYC 2P12.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F05 or PSYC 2P12.  CHYS 2P15  Principles of Service-Learning  Applying service-learning theories and principles within an educational setting and examining the service experience within multidisciplinary perspectives.  Restriction: open to BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate) BPhED (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior) and BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate) majors with a minimum 60 percent overall average and permission of the Department.  Prerequisite(s): CHYS 1F90.  Corequisite(s): CHYS 2P10.  Note: offered online. Course enrolmemt is limited. Completion of a service-learning component is required by all students. Transportation to the setting is a student responsibility. Students will be required to make arrangements for a police record check with a vulnerable sector screening. Students must submit an application to the appropriate police service, not earlier than May 1, and assure police check is received by the Department not later than July 15. Permission for course registration will not be granted until the satisfactory police record check is received by the department. Cost associated with the police record check is a student responsibility. Students may also be required to complete mandatory training (i.e., Health and Safety, AODA). This course is designed to promote the bridging of disciplines. Failure to submit the completed, signed Service Learning Verification form (Attendance Record) for the successful community or school setting, or failure to complete the on-line course component, will result in a grade of F for the course.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F15, 2F16 or 2P16.  CHYS 2P16  Principles of Community Engagement in Education  Multidisciplinary exploration of concepts, practices, and implications of engagement in educational settings. Includes reflection on and discussion of young people\u0092s experiences within diverse educational contexts and relationships, as conveyed through observational video resources and presentations by community-based guest speakers.  Lectures, seminar, 3 hours per week.  Restriction: open to BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate), BPhED (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior) and BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate) majors.  Prerequisite(s): CHYS 1F90.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F15, 2F16, or 2P15.  CHYS 2P22  Education and Equity  Contemporary issues in education in Canada and globally. Topics may include implications of globalization, teacher education, teachers and professors as workers, equity issues (gender, race, sexuality, age and class), and efforts to alter curriculum and pedagogy (critical, feminist, anti-racist).  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors until date specified in Registration guide.  Prerequisite(s): SOCI 1F90.  Note: students may not concurrently register in SOCI 2P22.  Completion of this course will replace previous assigned grade and credit obtained in SOCI 2P22.  CHYS 2P35  Children and Youth With Exceptionalities  Theoretical aspects of development of children and youth with exceptional needs. Topics may include cognitive, physical and psychological\/emotional differences.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide.  Prerequisite(s): CHYS 1F90 or 1F95.  CHYS 2P38  Childhood, Youth and Society  Historical, cross-cultural and sociological perspectives on the relationship between childhood, youth and society. Topics include children and youth in schools, communities, popular culture and state policy.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide.  Prerequisite(s): CHYS 1F90 or 1F95.  Note: students may not concurrently register in SOCI 2P38.  Completion of this course will replace previous assigned grade and credit obtained in SOCI 2P38.  CHYS 2P51  Research Methods in Child and Youth Studies I  Introduction to qualitative and applied approaches in the multidisciplinary study of children and youth, emphasizing theoretical foundations, research design, data collection, and analysis.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 60 percent overall average or permission of the Department.  Prerequisite(s): CHYS 1F90.  CHYS 2P52  Research Methods in Child and Youth Studies II  Introduction to quantitative and applied approaches in the multidisciplinary study of children and youth, emphasizing theoretical foundations, research design, data collection, and analysis.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 60 percent overall average or permission of the Department.  Prerequisite(s): CHYS 1F90.  #CHYS 2P92  Gender and Violence  (also offered as WGST 2P92)  Feminist sociological examination of various issues related to gender and violence across the lifespan. Topics may include intersectional analyses of dominant social systems of power and violence, rape culture, structural forms of gender-based violence, war, militarization, and the gendered dimensions of serial murder.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 4.0 overall credits.  #CHYS 2P95  Masculinities: A Feminist Perspective  (also offered as SPMA 2P95 and WGST 2P95)  Critical perspective to explore masculinities and the relationship between multiple dimensions of social relations and inequalities across the lifespan: gender, race\/ethnicity, class, and sexual orientation. Examines how masculinities are produced in varied sport, social, historical and cultural sites.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 4.0 overall credits.  Note: may be offered online.  #CHYS 2P99  Literacy in Childhood and Youth  (also offered as LING 2P99)  Exploration of selected issues in literacy development. Topics may include reading, writing, the impact of information technology on literacy development in the Canadian or global context.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS (Honours)\/BEd (Primary\/Junior), APLI (single or combined), HEAR, NEUR, PSYC (single or combined), SPLS (single or combined) majors, CHYS, APLI, PSYC minors, HESC, SLSC and TESC Certificate students until date specified in Registration guide.  Prerequisite(s): LING 1P94 (1F94), or PSYC 1F90.  Note: the prerequisite LING 1P94 may be taken concurrently with this course.  #CHYS 2Q90  Parenting: 'Family', Images, Issues and Patterns  (also offered as SOCI 2Q90 and WGST 2Q90)  Parenting as it is theorized\/analyzed in interdisciplinary feminist scholarship and portrayed in fictional or autobiographical writings and art forms. The historical, socio-cultural, sexual and political construction of gender and families.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 4.0 overall credits.  CHYS 2V91-2V99  Special Topics  Topic will vary depending on the needs of the program and availability of a faculty instructor.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors until date specified in Registration guide.  CHYS 2V91  2020-2021: Children and Youth in Sports Contexts  Theoretical and applied issues in sports relating to child athletes. Topics may include definition of sports, training contexts, accessibility and accommodations, disability, race, gender and sexuality, long-term outcomes, field work relationships, ethical issues, and issues in training development, application, and evaluation.  Restriction: open to students with a minimum of 5.0 overall credits, a minimum 60 percent overall average and permission of the Department.  Prerequisite(s): one Social Sciences context credit.  Note: offered online. Completion of an experiential component required by all students. Transportation to the experiential setting is a student responsibility. Students must submit an application to the appropriate police service in January, to assure police check is received by the Department no later than May 1. Permission for course registration will not be granted until the satisfactory police record check with a vulnerable sector screening is received by the Department. Cost associated with the police record check is a student responsibility. Students may also be required to complete mandatory training (i.e., Health and Safety, AODA) and other procedures associated with the experiential component. Failure to submit the completed, signed Experiential Setting Verification form (Attendance Record), or failure to complete the on-line course component, will result in a grade of F for the course. This course is part of the 2021 Summer Games Initiative.  #CHYS 3F02  Cognition and Learning  (also offered as EDUC 3F02)  Psychological approaches to cognitive, behavioural and social development. Cognitive processes in learning and instruction (assisting students to use appropriate cognitive processes on specific academic tasks). Cognitive theories applied to school subject areas including reading, writing, mathematics and science.  Lectures, seminar, 3 hours per week.  Restriction: open to BA CHYS (Honours)\/BEd (Primary\/Junior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Junior\/Intermediate) majors with a minimum of 8.0 overall credits and to BECE majors until date specified in Registration guide.  Prerequisite(s): CHYS 1F90 or permission of the Department.  Completion of this course will replace previous assigned grade and credit obtained in CHYS (EDUC) 2F01.  CHYS 3F92  Children and Youth With Special Needs  Theoretical and applied issues in assessment and intervention. Topics may include field work relationships, ethical issues, participant observation, and issues in program development, application and evaluation.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors with a minimum of 14.0 overall credits or permission of the Department.  Prerequisite(s): one half CHYS credit from Cluster B.  Note: a community placement is required. Enrolment will be limited to the availability of an appropriate match between a student and a child\/youth. Transportation to placement is a student responsibility. A current police check (including a vulnerable sector check) is required. Students must submit an application to the appropriate police service, assuring the police check is received by the Department not later than September 10. Cost associated is a student responsibility. For placement purposes, proof of freedom from active tuberculosis may be required. Failure to submit the completed, signed, placement verification form (Attendance Record) will result in a grade of F for the course.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 3P92.  CHYS 3P09  Culture and Mental Health of Children\/Youth  Environmental risk factors on the etiology and trajectories of childhood and youth behavioural\/emotional disorders. Emphasis on the influence of culture, gender, and race\/ethnicity.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10.  CHYS 3P10  Qualitative Research Methods in Child and Youth Studies  Philosophical assumptions, common qualitative methodologies, their design and procedures, and techniques for writing effective proposals. Overview of contemporary critical thought impacting qualitative research in the social sciences and beyond.  Lectures, tutorial, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10, 2P35 and 2P38; CHYS 2P51, or SOCI 2P00 and 2P11.  *CHYS 3P11  Theories of Development and Socialization  (also offered as PSYC 3P11)  Interdisciplinary exploration of child and youth development and socialization, including the foundational literature in psychology, sociology and anthropology, as well as contemporary and critical interpretive theories of childhood and youth.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits or 3.0 PSYC credits above PSYC 1F90.  Prerequisite(s): CHYS 2P10 or PSYC 2P12.  CHYS 3P12  Emotions in Children and Youth  Multidisciplinary consideration of theoretical and applied issues in the development of emotion, including interaction between cognition and emotion, and the role of motivation. Topics may include emotion theories, theory of mind, empathy, motivation, disorders, and cross-cultural perspectives.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10.  CHYS 3P15  Quantitative Research Methods in Child and Youth Studies  Data screening and descriptive statistics, univariate procedures for correlation and group comparison, multiple regression, data assumptions and statistical software application, including data management and interpretation of results.  Lectures, tutorial, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10; one of CHYS 2P52, PSYC 2F23, SOCI 2P00 and 2P11.  CHYS 3P20  Learning Disabilities  Current theoretical, methodological and remedial approaches to learning disabilities in children and youth. Cognitive and social aspects of learning disabilities.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  #CHYS 3P23  Psychology of Parenting  (also offered as PSYC 3P23)  Determinants, varieties and consequences of parenting focusing on psychological research findings in contemporary parenting\/parenthood issues. Topics include different styles of parenting, parent-child relationships, child maltreatment, parenting children with different temperaments and parenting in ecological contexts.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, PSYC (single or combined) majors and PSYC minors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits or 3.0 PSYC credits above PSYC 1F90.  Prerequisite(s): CHYS 2P10 or PSYC 2P12; PSYC 1F90.  CHYS 3P24  Development of Peer Relationships  Influences of peer relationships on cognitive, social and emotional development. Topics may include social competence, social influence, aggression and bullying.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10.  Note: students may not concurrently register in PSYC 3P77.  Completion of this course will replace previous assigned grade and credit obtained in PSYC 3P77.  CHYS 3P26  Introduction to Infants and Preschoolers with Special Needs  Issues in the assessment of children, as well as preventative and early intervention strategies. Variety of assessment techniques including testing, observation and rating scales.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, PSYC (single or combined) majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, PSYC (single or combined) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  CHYS 3P27  Policies of Childhood and Youth: Canadian Perspectives  Canadian initiatives in child welfare, education, health and children's rights within a broader global context. Roles of national and local governments, non-governmental organizations, professionals, adults and children.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P28  Rights of the Child  Canadian and global initiatives in child provision, child protection and child participation before and after the 1989 United Nations Convention on the Rights of the Child.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P30  Embodiment of Children and Youth  How the physical body is experienced and performed in the lives of children and youth.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P31  Practical and Theoretical Issues in Child and Youth Work  Introduction to key issues in policy and programmatic responses, philosophy, values, roles, ethics and tasks.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Note: may be offered on-site, online or blended.  CHYS 3P32  Children, Youth and Popular Culture  Influences of popular culture, including film, television, music, performing arts, video games and literature.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P35  Developmental Disabilities: Issues of Inclusion  Philosophical and practical issues of inclusion of the child and youth with disabilities in the family, schools and the community.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  *CHYS 3P36  Conflict, Contradictions and Development  (also offered as PSYC 3P36)  Conflict in early human development including the understanding of the causes, management and outcomes of conflicts. Cognitive and social strategies used to resolve conflicts.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors, GHUM, SOSC students and CHYS minors until date specified in Registration Guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10, PSYC 2P12 or permission of the instructor.  CHYS 3P38  Children, Youth and Families  Research on children and youth in families from historical, comparative and contemporary perspectives. Topics may include theories of the family, comparative family relations, issues of social change and policy and their impact on children and youth in the context of family life.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Note: may be offered on-site, online or blended. Students may not concurrently register in SOCI (WGST) 2P21.  Completion of this course will replace previous assigned grade and credit obtained in SOCI (WGST) 2P21.  CHYS 3P39  Children, Youth and the Law  Introduction to the ways in which children and youth are regulated through the law in Canada. Exploration of various statutes and provisions relating to education, sexuality, family violence, mental health, and the youth justice system.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Note: may be offered on-site, online or blended.  CHYS 3P43  Behavioural Challenges of Children and Youth  Factors influencing behavioural challenges presented by children and youth, within a multi-modal paradigm. Use of case examples to illustrate the model from the perspective of assessment and intervention.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  *CHYS 3P44  Gender and Sexuality in Childhood and Youth  (also offered as SOCI 3P44 and WGST 3P44)  Historical, cross-cultural and sociological approaches to the development of gender identities and sexuality amongst children and youth. Topics include the role of families, schools, peers and state policies.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), SOCI (single or combined), WGST (single or combined) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), SOCI (single or combined), WGST (single or combined), majors, GHUM, SOSC students, CHYS, CRAS, SOCI and WGST minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): one of CHYS 2P38, SOCI 2P00 and 2P11, 2P38, WGST 2P90, 2P91.  CHYS 3P47  Introduction to Behaviour Analysis and Therapy  Basic learning principles, procedures, and concepts and how they can be applied to support children and youth in everyday life. Focus on disabilities and mental health issues in school, clinical, family, and other settings.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  Note: students may not concurrently register in ADST 4P90 or PSYC 2P45.  Completion of this course will replace previous assigned grade and credit obtained in ADST 4P90 and PSYC 2P45.  #CHYS 3P50  Focus on Early Childhood Education I  (also offered as EDUC 3P50)  Early childhood education programs for children from birth to age eight. Topics include the historical and societal influences on early childhood education, program models derived from theories of learning and child development and research on the effectiveness of these programs.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) majors with a minimum of 9.0 overall credits and to BECE students until date specified in Registration guide.  CHYS 3P60  Autism  Nature, epidemiology, assessment, treatment and research of Autism and the other Autistic Spectrum Disorders focusing on research, educational and clinical practice.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  #CHYS 3P61  Child Language Acquisition: Early Stages  (also offered as LING 3P61 and PSYC 3P61)  Theories, research and methods in early language development. Linguistic stages in the development of child language at the level of grammar and meaning (phonology, morphology, syntax, semantics, pragmatics). Discourse as an indicator of the socialization process. Effects of interaction with care givers. Early bilingualism.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS (Honours)\/BEd (Primary\/Junior), APLI (single or combined), HEAR, NEUR, PSYC (single or combined), SPLS (single or combined) majors, CHYS, APLI, PSYC minors, HESC, SLSC and TESC Certificate students until date specified in Registration guide.  Prerequisite(s): LING 1P92 or PSYC 1F90.  Note: LING 1P92 may be taken concurrently with this course.LING 1P94 and 1P95 (1F94) recommended.  CHYS 3P65  Understanding Children's Minds  Developmental perspectives on children's thinking. Topics may include theory of mind, problem solving, language, memory, representation, humour, sarcasm, story-telling, narratives and disabilities.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10.  Note: students may not concurrently register in PSYC 3P60.  Completion of this course will replace previous assigned grade and credit obtained in PSYC 3P60.  #CHYS 3P68  Gender and Health: Local and Global Issues  (also offered as HLSC 3P68 and WGST 3P68)  Issues relating to women, gender and health and wellness from a critical feminist perspective. Themes on social and political contexts concerning women, girls, genders and health; social and environmental issues affecting health and illness; personal and cultural meanings of health and the body.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 6.0 overall credits.  Prerequisite(s): one of CHYS 1F90, HLSC 1F90, WGST 1F90 or permission of the instructor.  Note: may be available online.  *CHYS 3P74  Children and Youth in the Digital Age  (also offered as PSYC 3P74)  Theoretical, political, practical, legal and developmental perspectives on the use and impact of digital media and current technologies. Topics may include social networking, cyber-bullying, communication patterns, gamification and media literacy.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10 or PSYC 2P12.  Note: may be offered on-site, online or blended.  #CHYS 3P80  The Health of Children  (also offered as HLSC 3P80)  Exploration of the biological, psychological and sociological determinants of children's health.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, CMTY and PHTH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BMED, CHHS, CHLH, CHSC, HLSC, MSCI and PHTH majors until date specified in Registration guide.  Prerequisite(s): CHYS 2P10 or HLSC 1F90; CHYS 2P51 and 2P52 (2F50) or HLSC 2P27.  CHYS 3P90  Development of Conscience and Self-Regulation  How conscience develops, when it first emerges, and the implications of the development of early conscience for children's future adjustment. Historical, theoretical and applied shifts in focus from single components of conscience and self-regulation to the current emphasis on their integration.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P10.  Note: may be offered on-site, online or blended.  CHYS 3P91  Applications of Behaviour Analysis and Therapy  Use of learning principles, procedures, and concepts to address everyday problems and clinical issues experienced by children, youth and families. Case studies related to developmental disabilities and mental health problems including autism, ADHD and anxiety issues.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA(Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 3P47 or 3P60.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 3P48.  CHYS 3P93  Learning Disabilities: Laboratory  Supervised experience in analysis and evaluation of informal assessment and treatment strategies to be used with children at-risk for learning disabilities.  Lectures, lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 3P20 or permission of the Department.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 3P21.  CHYS 3P94  Childhood, Youth and Equity Issues  Research on contemporary children and youth focusing on how age and generation intersect with social class, race and gender. Topics include children's rights, child poverty and equity strategies.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P95  Childhood and Youth Through the Ages  Historical conceptions of children, childhood, youth and development, and their relation to contemporary theory and research.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): one of CHYS 2P10, 2P38, SOCI 2P38.  CHYS 3P96  Racism and Constructions of Race  Historical and current construction and effects of race and ethnicity in the lives of children and youth in Canada and globally.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): one of CHYS 2P10, 2P38, SOCI 2P38.  CHYS 3P97  Children and Youth in Indigenous Communities  Multidisciplinary exploration of North American and International perspectives on children and youth in Indigenous communities.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): one of CHYS 2P10, 2P38, SOCI 2P38.  #CHYS 3P98  Domestic and Intimate Violence  (also offered as CRIM 3P98 and SOCI 3P98)  Critical overview of theories of and legal responses to family and intimate violence. Research on these forms of abuse and response of police, the courts and other components of the social and legal system.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 7.0 overall credits or 2.0 SOCI credits above SOCI 1F90.  Prerequisite(s): SOCI 1F90.  Completion of this course will replace the previous assigned grade and credit obtained in CHYS (SOCI) 3P83.  CHYS 3P99  Contemporary Issues in Childhood and Youth Studies  Contemporary issues in child and youth studies. Topics vary depending on current events and on-going debates and across socio-cultural, exceptionalities and developmental perspectives.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): one of CHYS 2P10, 2P35, 2P38, SOCI 2P38.  CHYS 3Q90  Directed Studies  Program of study or research practicum not available among the regular course offerings, designed in consultation with the faculty member directing the course.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 7.0 overall credits and approval of the co-ordinator.  Note: arrangements must be agreed upon with the co-ordinator prior to registration. Normally taken in conjunction with an honours thesis.  CHYS 3Q91  Young Offenders and Youth Justice  Multidisciplinary perspectives in understanding youth in conflict with the law. Role of macro factors in the commission of offences, including unemployment, systemic discrimination based upon gender, race and sexuality, and media constructions of youth.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 3P40.  #CHYS 3Q96  Children and Youth at Work  (also offered as LABR 3Q96)  Multidisciplinary exploration of North American and international perspectives on child labour and youth in the labour market.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and LABR (single or combined) majors until date specified in Registration guide.  Prerequisite(s): one of CHYS 1F90, one LABR credit numbered 1(alpha)90 to 1(alpha)99, SOCI 1F90.  Note: may be offered on-site, online or blended.  CHYS 3V40-3V99  Special Topics Seminar  The topic will vary depending on the needs of the program and availability of a faculty instructor.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 8.0 overall credits.  CHYS 3V55  2020-2021: Developmental Neuropsychology of Exceptionalities  Foundational exploration of brain development and functioning in children and youth with neurological and psychological exceptionalities. Topics may include typical and atypical brain development, basics of neuropsychological assessment and intervention, and consequences (cognitive, affective, behavioural, educational) of neurological and psychological exceptionalities associated with birth-related and traumatic brain injuries, paediatric multiple sclerosis, ADHD, and learning disabilities.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  CHYS 3V85  2020-2021: Professional Topics in Child and Youth Studies  Practical, ethical, and legal issues involved in working with children and youth. Topics may include post-degree training and professional programs, professionalism, research and clinical ethics, privacy legislation, self-presentation, standards of professional practice and delivery of services in a variety of contexts, including applied and research settings.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2F15 or 2P15.  CHYS 3V92  2020-2021: Executive Functions in Children and Youth  Self-regulation of behaviour in the context of typical and atypical development, emphasizing assessment, intervention and prevention. Topics may include the development of executive functions from infancy through early adulthood and their impact on educational achievement, daily life, mental health and wellness.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P10 or 2P35.  CHYS 3V93  2020-2021: Addiction in the Family  Biological, historical, psychological, behavioural, and sociocultural aspects of addictions with a particular focus on how families impact and are impacted by addiction. Topics may include the nature and structure of families, models and theories of addiction, etiology of addictions, assessment and diagnosis, contemporary research in the field of addictions, and different approaches to treatment and recovery.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P10, 2P35, or 2P38.  CHYS 3V94  2020-2021: Children's Participation  Practices, theories, controversies and contemporary issues in young people's participation, including tension between participation and protection. Topics may include children\u0092s involvement in decision-making; cultural contributions; involvement in production and consumption; and children\u0092s activism.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P10, 2P35 or 2P38.  CHYS 4F80  The Disciplinary Continuum  Uni-, to inter-, to trans-disciplinarity approaches in the study of current topics related to childhood and youth such as self-regulation, bullying, exceptionalities, risk-taking, peer cultures, popular culture, and rights.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: may be offered on-site, online or blended. Students may not concurrently register in CHYS 4F95 or 4F99. Students must hold a 70 percent overall average in CHYS 3P10 and 3P15.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4F95 and 4F99.  CHYS 4F95  Applied Research Project  Involving students in community-based or faculty research projects focusing on service-learning principles, partnerships and diverse deliverables.  Restriction: open to CHYS (single or combined) majors with a minimum of 14.0 overall credits, approval to year 4 (honours) and permission of the Department.  Prerequisite(s): CHYS 3P10 and 3P15.  Corequisite(s): CHYS 4P70.  Note: students may be required to make arrangements for a police check, including a vulnerable sector screening. Students must hold a minimum 75 percent overall average in CHYS 3P10 and 3P15.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4F80 and 4F99.  CHYS 4F99  Honours Individual Thesis  Research project carried out under the supervision of a faculty adviser.  Restriction: open to CHYS (single or combined) majors with a minimum of 14.0 overall credits, approval to year 4 (honours) and permission of the Department.  Prerequisite(s): CHYS 3P10 and 3P15.  Corequisite(s): CHYS 4P70.  Note: students must hold a minimum 75 percent overall average in CHYS 3P10 and 3P15.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4F80 and 4F95.  CHYS 4P01  Development of Self and Identity  Multidisciplinary exploration of the development of self and identity in childhood and adolescence, focusing on classic and contemporary theoretical frameworks. Topics include distinction between self-as-subject and self-as-object, unity versus multiplicity in the self, and social construction of selfhood.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P02  Peer Cultures  Survey of peer cultures emphasizing social structural and interpretive understandings of peer group formation and their impact on child and youth identity.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P03  Approaches to Family Assessment and Intervention  Theoretical, research and clinical issues pertaining to assessment and intervention with families. Interventions include parent training and family counselling. Focusing on early identification and intervention.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum or 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P04  Early Intervention and Prevention Systems  Examination of community and organizational systemic factors contributing to the prevention of problems, and aiding in early intervention in the lives of children and youth with special needs. Focus on the development and evaluation of community programs.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P06  Children in War Zones  Physical, social and psychological consequences of modern warfare on children as both victims and combatants.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P07  Issues in Multiculturalism  Policy and practice around multiculturalism in Canada and globally. Topics include educational policy, developing perceptions of multiculturalism, cultural diversity and intercultural relations.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P08  Companion Animals and Children and Youth  Multidisciplinary consideration of the role of companion animals in the social and emotional lives of children and youth. Topics may include animal\/child abuse, disability and therapy, empathy and self-esteem, coping and resilience, and sociocultural perspectives.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P09  Disability Studies  Critical interdisciplinary exploration of disability as a social, cultural, historical, and political phenomenon. Challenges popular representations of disability as a personal tragedy or individual problem to be fixed and critically assesses the ways disability is conceptualized in societal institutions (e.g., schools). Topics may include the disability\/impairment distinction, inclusion, disability identity, and forms of disability activism.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P10  Counselling and Helping Relationship Praxis  Theories and skills appropriate to a variety of interviewing and helping professional roles and responsibilities. Core skills associated with attending, responding, exploring and terminating stages emphasized within the context of relationship-building pertaining to child and youth studies, education, career, social services, health and general human management needs, and concerns.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4V10.  CHYS 4P16  Children, Youth and Globalization  Political-economic and postmodern perspectives on globalization and its effect on children and youth.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major, a 70 percent overall average in CHYS 3P10 and 3P15, average and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P20  The Worried Mind: Anxiety and Cognitive Functions  Influence of worry\/anxiety on cognitive functions in children and youth. Theories and models of anxiety in the context of typical and atypical neurodevelopment of cognitive functions, socio-emotional manifestations of cognitive dysfunctions related to anxious situations.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  Completion of this course will replace the previous assigned grade and credit obtained in CHYS 4V01.  CHYS 4P22  Theory for Social Change in the Lives of Young People  Radical, emancipatory socio-cultural theories that challenge and rethink the established social order. Topics may include resistance, activism, revolution and dramatic rethinking of the institutions and rules that structure the lives of children and youth.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P25  The Social Origins of Children's Minds  Investigation of traditional and contemporary approaches highlighting the links between social, cultural, historical and institutional settings, and the development of mental processes.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major, a 70 percent overall average in CHYS 3P10 and 3P15, average and a minimum of 14.0 overall credits may be able to register. Contact the Department.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4V06.  CHYS 4P30  Human Rights and Disability  Theoretical and applied issues related to the promotion and protection of human rights for persons with disabilities. Topics may include the United Nations Convention on the Rights of Persons with Disabilities, Accessibility for Ontarians with Disabilities Act, implications for inclusive education, person centred service planning and self advocacy.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P35  Advanced Topics in Children and Youth with Exceptionalities  Contemporary issues of social policy and practice affecting the exceptionalities of children and youth.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P36  Theoretical and Practical Issues in Conflict Resolutions  Sociocognitive examination of theories and evidence-based practices of conflict resolution interventions. Focus on traditional and recent transformative approaches to resolving peer relational difficulties, and developmental outcomes of functional and dysfunctional resolution.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: CHYS 3P36 highly recommended. With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  *CHYS 4P38  Advanced Topics in Childhood, Youth and Society  (also offered as SOCI 4P38)  Canadian and international research on childhood and youth in changing societies. Topics include globalization of childhood and youth, child labour, child welfare and Canadian policy.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and SOCI (single or combined) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P39  Sentencing and Punishment of Youth  Philosophical and legal foundations, objectives and process of sentencing and punishment of young offenders in Western societies. Gaps between sentencing theory and practice, and issues such as the roles of plea bargaining, mitigating and aggravating factors, victims, and adult sentences for youth.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Prerequisite(s): CHYS 3P39 or 3Q91 (3P40).  Note: CHYS 3P39 recommended. With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P41  Risk-Taking in Youth  Topics may include youth lifestyle choices, problem behaviour theory, risk and protective factors, competence, and developmental pathways in the context of community, family, peer, and intrapersonal factors.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P44  Advanced Topics in Gender and Sexuality  Theories of gender and sexuality. Development of gender and sexual identities. Historical and cross-cultural investigations, institutional patterns, representations and inequality.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P45  The Moral Child  Current theories and practices related to moral engagement and disengagement in young people. Multidisciplinary focus on the development of morality in children and youth. Topics may include socialization processes, evolutionary pressures and brain science.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14. overall credits may be able to register. Contact the Department.  CHYS 4P48  Advanced Topics in Behaviour Analysis and Therapy  Use of behaviour analysis and related approaches, including cognitive behaviour therapy, to support individuals with autism and other disabilities and mental health issues.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Prerequisite(s): CHYS 3P47 or 3P60.  Note: With major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P50  Trauma and Abuse in the Lives of Children and Youth  Issues in identification, prevention and intervention in trauma and abuse of children and youth. Systemic analysis focusing on family, school and social influences on prevention and recovery.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  #CHYS 4P56  Maturation and Development  (also offered as PSYC 4P56)  Influences of brain maturation on psychological development and vice versa, and the implications for behaviour.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), NEUR and PSYC (single or combined) majors until date specified in Registration guide. Students must have a minimum of 13.0 overall credits or 5.0 PSYC credits above PSYC 1F90.  Prerequisite(s): one of CHYS 2P10, PSYC 2P12, 2P35, 2P36.  CHYS 4P65  Minds in Transition  Advanced contemporary issues in the development of thinking. Topics may include the development of executive functions, theory of mind, memory, problem solving, creativity, moral reasoning and thinking about the social world.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: CHYS 3P65 recommended. With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P70  The Craft of Research  Advanced issues in the planning, production and (re)presentation of research on children and youth. Topics include formulating research questions, addressing ethical concerns and writing research results.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) majors with a minimum of 14.0 overall credits, approval to year 4 (honours) and permission of the Department.  Prerequisite(s): CHYS 3P10 and 3P15.  Corequisite(s): CHYS 4F95 or 4F99.  Note: students not in Individual Thesis or Applied Research Project streams may register. Contact the Department.  CHYS 4Q90  Directed Studies  Program of study or research practicum not available among the regular course offerings, designed in consultation with the faculty member directing the course.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits, approval to year 4 (honours) and approval of the co-ordinator.  Note: arrangements must be agreed upon with the co-ordinator prior to registration. Normally taken in conjunction with an honours thesis.  CHYS 4V00-4V10  Advanced Special Topics  CHYS 4V02  2020-2021: Children, Youth and Climate Change: Transdisciplinary Approaches  Present and potential role of children and youth in understanding and critically responding to environmental disruption associated with human activity in the current geological age of the Anthropocene. Focuses on current debates and activism surrounding climate change and other environmental issues bearing on young people and their futures.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 14.0 overall credits and approval to year 4 (honours).  Note: with Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4V03  2020-2021: Childhood, Art and Aesthetic Expression  Complex acts of symbolization and expression contained in children's art and art about children, including drawing, painting, photography, film, and literature. Topics may include art therapy with children, exhibitions of children's art, arts-based research methods, and the uses of art during and after social conflict.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA(Honours)\/BEd (Primary\/Junior) majors with a minimum 14.0 overall credits and approval to year 4 (honours).  Note: with Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.",
    "1": "Students must check to ensure that prerequisites are met. Students may be deregistered, at the request of the instructor, from any course for which prerequisites and\/or restrictions have not been met.  CHYS 1F90  Introduction to Child and Youth Studies  Theories, methods and issues involved in studying children and youth from a multidisciplinary perspective. Topics may include the history of childhood, family life, peer relations and children and youth with special needs.  Lectures, seminar, 3 hours per week.  Restriction: open to students admitted to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/IntermediaA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate), Bte), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate) and CHYS minors until date specified in Registration guide. In Spring session open to all students.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 1F95.  CHYS 1F95  Child and Youth Studies in Indigenous Contexts  Theories, methods and issues involved in studying children and youth from a multidisciplinary perspective. Topics may include the developmental psychology, history of childhood, family life, peer relations and children and youth with special needs within an Indigenous education context.  Lectures, seminar, 72 contact hours.  Restriction: open to BEd-Primary\/Junior (Aboriginal) majors.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 1F90.  CHYS 1M90-1M99  Special Topics  Topic will vary depending on the needs of the program and availability of a faculty instructor.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA(Honours)\/BEd (Primary\/Junior) majors.  CHYS 2F05  Development in Indigenous Contexts  Basic concepts and contemporary issues in the development of the child and youth focusing on Indigenous contexts. Topics may include processes in cognitive and social-emotional patterns of change, education and development, diversity within development and alternative theories. Developmental theory and research provides the conceptual framework focusing on Indigenous contexts.  Lectures, seminar, 72 contact hours.  Restriction: open to BEd-Primary\/Junior (Aboriginal) majors.  Prerequisite(s): CHYS 1F95 (1M95).  Note: students may not concurrently register in CHYS 2P10 or PSYC 2P12. This course will draw upon relevant work or volunteer experience. Students must have completed 60 hours of work or volunteer experience within education or community-based settings that serve children and youth prior to enrolling in the course.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2M01, CHYS 2P10 and PSYC 2P12.  CHYS 2F15  Principles of Service-Learning in Child and Youth Studies  Applying service-learning theories and principles within a community\/educational setting and examining the service experience within multidisciplinary perspectives.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 60 percent overall average and permission of the Department.  Prerequisite(s): CHYS 1F90.  Corequisite(s): one of CHYS 2P10, 2P35, 2P38.  Note: offered online. Course enrolment is limited. Completion of a service-learning component is required by all students. Transportation to the setting is a student responsibility. Students will be required to make arrangements for a police record check with a vulnerable sector screening. Students must submit an application to the appropriate police service, not earlier than May 1, and assure police check is received by the Department not later than July 15. Permission for course registration will not be granted until the satisfactory police record check with a vulnerable sector screening is received by the department. Cost associated with the police record check is a student responsibility. Students may also be required to complete mandatory training (i.e., Health and Safety, AODA). This course is designed to promote the bridging of disciplines. Failure to submit the completed, signed Service Learning Verification form (Attendance Record) for the successful community or school setting, or failure to complete the on-line course component, will result in a grade of F for the course.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F16, 2P15 or 2P16.  CHYS 2F16  Principles of Community Engagement in Child and Youth Studies  Multidisciplinary exploration of concepts, practices, and implications of engagement in community and educational settings. Includes reflection on and discussion of young people\u0092s experiences within diverse contexts and relationships, as conveyed through observational video resources and presentations by community-based guest speakers.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors.  Prerequisite(s): CHYS 1F90.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F15, 2P15 or 2P16.  CHYS 2M00-2M10  Special Topics  Topic will vary depending on the needs of the program and availability of a faculty instructor.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors.  CHYS 2P10  Child and Youth Development  Basic concepts and contemporary issues in the development of the child and youth, including processes in cognitive and social-emotional patterns of change. Developmental theory and research provides the conceptual framework.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/IntermediaA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate), Bte), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide.  Prerequisite(s): CHYS 1F90 or 1F95.  Note: students may not concurrently register in PSYC 2P12.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F05 or PSYC 2P12.  CHYS 2P15  Principles of Service-Learning  Applying service-learning theories and principles within an educational setting and examining the service experience within multidisciplinary perspectives.  Restriction: open to BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate) BPhED (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior) and BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate) majors with a minimum 60 percent overall average and permission of the Department.  Prerequisite(s): CHYS 1F90.  Corequisite(s): CHYS 2P10.  Note: offered online. Course enrolmemt is limited. Completion of a service-learning component is required by all students. Transportation to the setting is a student responsibility. Students will be required to make arrangements for a police record check with a vulnerable sector screening. Students must submit an application to the appropriate police service, not earlier than May 1, and assure police check is received by the Department not later than July 15. Permission for course registration will not be granted until the satisfactory police record check is received by the department. Cost associated with the police record check is a student responsibility. Students may also be required to complete mandatory training (i.e., Health and Safety, AODA). This course is designed to promote the bridging of disciplines. Failure to submit the completed, signed Service Learning Verification form (Attendance Record) for the successful community or school setting, or failure to complete the on-line course component, will result in a grade of F for the course.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F15, 2F16 or 2P16.  CHYS 2P16  Principles of Community Engagement in Education  Multidisciplinary exploration of concepts, practices, and implications of engagement in educational settings. Includes reflection on and discussion of young people\u0092s experiences within diverse educational contexts and relationships, as conveyed through observational video resources and presentations by community-based guest speakers.  Lectures, seminar, 3 hours per week.  Restriction: open to BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BA Interactive Arts and Science (Honours)\/BEd (Junior\/Intermediate), BPhED (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior) and BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate) majors.  Prerequisite(s): CHYS 1F90.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 2F15, 2F16, or 2P15.  CHYS 2P22  Education and Equity  Contemporary issues in education in Canada and globally. Topics may include implications of globalization, teacher education, teachers and professors as workers, equity issues (gender, race, sexuality, age and class), and efforts to alter curriculum and pedagogy (critical, feminist, anti-racist).  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors until date specified in Registration guide.  Prerequisite(s): SOCI 1F90.  Note: students may not concurrently register in SOCI 2P22.  Completion of this course will replace previous assigned grade and credit obtained in SOCI 2P22.  CHYS 2P35  Children and Youth With Exceptionalities  Theoretical aspects of development of children and youth with exceptional needs. Topics may include cognitive, physical and psychological\/emotional differences.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide.  Prerequisite(s): CHYS 1F90 or 1F95.  CHYS 2P38  Childhood, Youth and Society  Historical, cross-cultural and sociological perspectives on the relationship between childhood, youth and society. Topics include children and youth in schools, communities, popular culture and state policy.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BA (Honours)\/BEd (Intermediate\/Senior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Intermediate\/Senior), BSc (Honours)\/BEd (Intermediate\/Senior), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide.  Prerequisite(s): CHYS 1F90 or 1F95.  Note: students may not concurrently register in SOCI 2P38.  Completion of this course will replace previous assigned grade and credit obtained in SOCI 2P38.  CHYS 2P51  Research Methods in Child and Youth Studies I  Introduction to qualitative and applied approaches in the multidisciplinary study of children and youth, emphasizing theoretical foundations, research design, data collection, and analysis.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 60 percent overall average or permission of the Department.  Prerequisite(s): CHYS 1F90.  CHYS 2P52  Research Methods in Child and Youth Studies II  Introduction to quantitative and applied approaches in the multidisciplinary study of children and youth, emphasizing theoretical foundations, research design, data collection, and analysis.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 60 percent overall average or permission of the Department.  Prerequisite(s): CHYS 1F90.  #CHYS 2P92  Gender and Violence  (also offered as WGST 2P92)  Feminist sociological examination of various issues related to gender and violence across the lifespan. Topics may include intersectional analyses of dominant social systems of power and violence, rape culture, structural forms of gender-based violence, war, militarization, and the gendered dimensions of serial murder.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 4.0 overall credits.  #CHYS 2P95  Masculinities: A Feminist Perspective  (also offered as SPMA 2P95 and WGST 2P95)  Critical perspective to explore masculinities and the relationship between multiple dimensions of social relations and inequalities across the lifespan: gender, race\/ethnicity, class, and sexual orientation. Examines how masculinities are produced in varied sport, social, historical and cultural sites.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 4.0 overall credits.  Note: may be offered online.  #CHYS 2P99  Literacy in Childhood and Youth  (also offered as LING 2P99)  Exploration of selected issues in literacy development. Topics may include reading, writing, the impact of information technology on literacy development in the Canadian or global context.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS (Honours)\/BEd (Primary\/Junior), APLI (single or combined), HEAR, NEUR, PSYC (single or combined), SPLS (single or combined) majors, CHYS, APLI, PSYC minors, HESC, SLSC and TESC Certificate students until date specified in Registration guide.  Prerequisite(s): LING 1P94 (1F94), or PSYC 1F90.  Note: the prerequisite LING 1P94 may be taken concurrently with this course.  #CHYS 2Q90  Parenting: 'Family', Images, Issues and Patterns  (also offered as SOCI 2Q90 and WGST 2Q90)  Parenting as it is theorized\/analyzed in interdisciplinary feminist scholarship and portrayed in fictional or autobiographical writings and art forms. The historical, socio-cultural, sexual and political construction of gender and families.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 4.0 overall credits.  CHYS 2V91-2V99  Special Topics  Topic will vary depending on the needs of the program and availability of a faculty instructor.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors until date specified in Registration guide.  CHYS 2V91  2020-2021: Children and Youth in Sports Contexts  Theoretical and applied issues in sports relating to child athletes. Topics may include definition of sports, training contexts, accessibility and accommodations, disability, race, gender and sexuality, long-term outcomes, field work relationships, ethical issues, and issues in training development, application, and evaluation.  Restriction: open to students with a minimum of 5.0 overall credits, a minimum 60 percent overall average and permission of the Department.  Prerequisite(s): one Social Sciences context credit.  Note: offered online. Completion of an experiential component required by all students. Transportation to the experiential setting is a student responsibility. Students must submit an application to the appropriate police service in January, to assure police check is received by the Department no later than May 1. Permission for course registration will not be granted until the satisfactory police record check with a vulnerable sector screening is received by the Department. Cost associated with the police record check is a student responsibility. Students may also be required to complete mandatory training (i.e., Health and Safety, AODA) and other procedures associated with the experiential component. Failure to submit the completed, signed Experiential Setting Verification form (Attendance Record), or failure to complete the on-line course component, will result in a grade of F for the course. This course is part of the 2021 Summer Games Initiative.  #CHYS 3F02  Cognition and Learning  (also offered as EDUC 3F02)  Psychological approaches to cognitive, behavioural and social development. Cognitive processes in learning and instruction (assisting students to use appropriate cognitive processes on specific academic tasks). Cognitive theories applied to school subject areas including reading, writing, mathematics and science.  Lectures, seminar, 3 hours per week.  Restriction: open to BA CHYS (Honours)\/BEd (Primary\/Junior), BA Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BSc Integrated Studies (Honours)\/BEd (Junior\/Intermediate), BPhEd (Honours)\/BEd (Junior\/Intermediate) majors with a minimum of 8.0 overall credits and to BECE majors until date specified in Registration guide.  Prerequisite(s): CHYS 1F90 or permission of the Department.  Completion of this course will replace previous assigned grade and credit obtained in CHYS (EDUC) 2F01.  CHYS 3F92  Children and Youth With Special Needs  Theoretical and applied issues in assessment and intervention. Topics may include field work relationships, ethical issues, participant observation, and issues in program development, application and evaluation.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors with a minimum of 14.0 overall credits or permission of the Department.  Prerequisite(s): one half CHYS credit from Cluster B.  Note: a community placement is required. Enrolment will be limited to the availability of an appropriate match between a student and a child\/youth. Transportation to placement is a student responsibility. A current police check (including a vulnerable sector check) is required. Students must submit an application to the appropriate police service, assuring the police check is received by the Department not later than September 10. Cost associated is a student responsibility. For placement purposes, proof of freedom from active tuberculosis may be required. Failure to submit the completed, signed, placement verification form (Attendance Record) will result in a grade of F for the course.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 3P92.  CHYS 3P09  Culture and Mental Health of Children\/Youth  Environmental risk factors on the etiology and trajectories of childhood and youth behavioural\/emotional disorders. Emphasis on the influence of culture, gender, and race\/ethnicity.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10.  CHYS 3P10  Qualitative Research Methods in Child and Youth Studies  Philosophical assumptions, common qualitative methodologies, their design and procedures, and techniques for writing effective proposals. Overview of contemporary critical thought impacting qualitative research in the social sciences and beyond.  Lectures, tutorial, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10, 2P35 and 2P38; CHYS 2P51, or SOCI 2P00 and 2P11.  *CHYS 3P11  Theories of Development and Socialization  (also offered as PSYC 3P11)  Interdisciplinary exploration of child and youth development and socialization, including the foundational literature in psychology, sociology and anthropology, as well as contemporary and critical interpretive theories of childhood and youth.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits or 3.0 PSYC credits above PSYC 1F90.  Prerequisite(s): CHYS 2P10 or PSYC 2P12.  CHYS 3P12  Emotions in Children and Youth  Multidisciplinary consideration of theoretical and applied issues in the development of emotion, including interaction between cognition and emotion, and the role of motivation. Topics may include emotion theories, theory of mind, empathy, motivation, disorders, and cross-cultural perspectives.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10.  CHYS 3P15  Quantitative Research Methods in Child and Youth Studies  Data screening and descriptive statistics, univariate procedures for correlation and group comparison, multiple regression, data assumptions and statistical software application, including data management and interpretation of results.  Lectures, tutorial, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10; one of CHYS 2P52, PSYC 2F23, SOCI 2P00 and 2P11.  CHYS 3P20  Learning Disabilities  Current theoretical, methodological and remedial approaches to learning disabilities in children and youth. Cognitive and social aspects of learning disabilities.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  #CHYS 3P23  Psychology of Parenting  (also offered as PSYC 3P23)  Determinants, varieties and consequences of parenting focusing on psychological research findings in contemporary parenting\/parenthood issues. Topics include different styles of parenting, parent-child relationships, child maltreatment, parenting children with different temperaments and parenting in ecological contexts.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, PSYC (single or combined) majors and PSYC minors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits or 3.0 PSYC credits above PSYC 1F90.  Prerequisite(s): CHYS 2P10 or PSYC 2P12; PSYC 1F90.  CHYS 3P24  Development of Peer Relationships  Influences of peer relationships on cognitive, social and emotional development. Topics may include social competence, social influence, aggression and bullying.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10.  Note: students may not concurrently register in PSYC 3P77.  Completion of this course will replace previous assigned grade and credit obtained in PSYC 3P77.  CHYS 3P26  Introduction to Infants and Preschoolers with Special Needs  Issues in the assessment of children, as well as preventative and early intervention strategies. Variety of assessment techniques including testing, observation and rating scales.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, PSYC (single or combined) majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, PSYC (single or combined) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  CHYS 3P27  Policies of Childhood and Youth: Canadian Perspectives  Canadian initiatives in child welfare, education, health and children's rights within a broader global context. Roles of national and local governments, non-governmental organizations, professionals, adults and children.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P28  Rights of the Child  Canadian and global initiatives in child provision, child protection and child participation before and after the 1989 United Nations Convention on the Rights of the Child.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P30  Embodiment of Children and Youth  How the physical body is experienced and performed in the lives of children and youth.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P31  Practical and Theoretical Issues in Child and Youth Work  Introduction to key issues in policy and programmatic responses, philosophy, values, roles, ethics and tasks.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Note: may be offered on-site, online or blended.  CHYS 3P32  Children, Youth and Popular Culture  Influences of popular culture, including film, television, music, performing arts, video games and literature.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P35  Developmental Disabilities: Issues of Inclusion  Philosophical and practical issues of inclusion of the child and youth with disabilities in the family, schools and the community.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  *CHYS 3P36  Conflict, Contradictions and Development  (also offered as PSYC 3P36)  Conflict in early human development including the understanding of the causes, management and outcomes of conflicts. Cognitive and social strategies used to resolve conflicts.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors, GHUM, SOSC students and CHYS minors until date specified in Registration Guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10, PSYC 2P12 or permission of the instructor.  CHYS 3P38  Children, Youth and Families  Research on children and youth in families from historical, comparative and contemporary perspectives. Topics may include theories of the family, comparative family relations, issues of social change and policy and their impact on children and youth in the context of family life.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Note: may be offered on-site, online or blended. Students may not concurrently register in SOCI (WGST) 2P21.  Completion of this course will replace previous assigned grade and credit obtained in SOCI (WGST) 2P21.  CHYS 3P39  Children, Youth and the Law  Introduction to the ways in which children and youth are regulated through the law in Canada. Exploration of various statutes and provisions relating to education, sexuality, family violence, mental health, and the youth justice system.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Note: may be offered on-site, online or blended.  CHYS 3P43  Behavioural Challenges of Children and Youth  Factors influencing behavioural challenges presented by children and youth, within a multi-modal paradigm. Use of case examples to illustrate the model from the perspective of assessment and intervention.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  *CHYS 3P44  Gender and Sexuality in Childhood and Youth  (also offered as SOCI 3P44 and WGST 3P44)  Historical, cross-cultural and sociological approaches to the development of gender identities and sexuality amongst children and youth. Topics include the role of families, schools, peers and state policies.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), SOCI (single or combined), WGST (single or combined) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), SOCI (single or combined), WGST (single or combined), majors, GHUM, SOSC students, CHYS, CRAS, SOCI and WGST minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): one of CHYS 2P38, SOCI 2P00 and 2P11, 2P38, WGST 2P90, 2P91.  CHYS 3P47  Introduction to Behaviour Analysis and Therapy  Basic learning principles, procedures, and concepts and how they can be applied to support children and youth in everyday life. Focus on disabilities and mental health issues in school, clinical, family, and other settings.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  Note: students may not concurrently register in ADST 4P90 or PSYC 2P45.  Completion of this course will replace previous assigned grade and credit obtained in ADST 4P90 and PSYC 2P45.  #CHYS 3P50  Focus on Early Childhood Education I  (also offered as EDUC 3P50)  Early childhood education programs for children from birth to age eight. Topics include the historical and societal influences on early childhood education, program models derived from theories of learning and child development and research on the effectiveness of these programs.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) majors with a minimum of 9.0 overall credits and to BECE students until date specified in Registration guide.  CHYS 3P60  Autism  Nature, epidemiology, assessment, treatment and research of Autism and the other Autistic Spectrum Disorders focusing on research, educational and clinical practice.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  #CHYS 3P61  Child Language Acquisition: Early Stages  (also offered as LING 3P61 and PSYC 3P61)  Theories, research and methods in early language development. Linguistic stages in the development of child language at the level of grammar and meaning (phonology, morphology, syntax, semantics, pragmatics). Discourse as an indicator of the socialization process. Effects of interaction with care givers. Early bilingualism.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS (Honours)\/BEd (Primary\/Junior), APLI (single or combined), HEAR, NEUR, PSYC (single or combined), SPLS (single or combined) majors, CHYS, APLI, PSYC minors, HESC, SLSC and TESC Certificate students until date specified in Registration guide.  Prerequisite(s): LING 1P92 or PSYC 1F90.  Note: LING 1P92 may be taken concurrently with this course.LING 1P94 and 1P95 (1F94) recommended.  CHYS 3P65  Understanding Children's Minds  Developmental perspectives on children's thinking. Topics may include theory of mind, problem solving, language, memory, representation, humour, sarcasm, story-telling, narratives and disabilities.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors and minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) majors, GHUM, SOSC students and CHYS minors date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10.  Note: students may not concurrently register in PSYC 3P60.  Completion of this course will replace previous assigned grade and credit obtained in PSYC 3P60.  #CHYS 3P68  Gender and Health: Local and Global Issues  (also offered as HLSC 3P68 and WGST 3P68)  Issues relating to women, gender and health and wellness from a critical feminist perspective. Themes on social and political contexts concerning women, girls, genders and health; social and environmental issues affecting health and illness; personal and cultural meanings of health and the body.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 6.0 overall credits.  Prerequisite(s): one of CHYS 1F90, HLSC 1F90, WGST 1F90 or permission of the instructor.  Note: may be available online.  *CHYS 3P74  Children and Youth in the Digital Age  (also offered as PSYC 3P74)  Theoretical, political, practical, legal and developmental perspectives on the use and impact of digital media and current technologies. Topics may include social networking, cyber-bullying, communication patterns, gamification and media literacy.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors and CHYS minors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), PSYC (single or combined) majors, GHUM, SOSC students and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P10 or PSYC 2P12.  Note: may be offered on-site, online or blended.  #CHYS 3P80  The Health of Children  (also offered as HLSC 3P80)  Exploration of the biological, psychological and sociological determinants of children's health.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH, CMTY and PHTH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), BMED, CHHS, CHLH, CHSC, HLSC, MSCI and PHTH majors until date specified in Registration guide.  Prerequisite(s): CHYS 2P10 or HLSC 1F90; CHYS 2P51 and 2P52 (2F50) or HLSC 2P27.  CHYS 3P90  Development of Conscience and Self-Regulation  How conscience develops, when it first emerges, and the implications of the development of early conscience for children's future adjustment. Historical, theoretical and applied shifts in focus from single components of conscience and self-regulation to the current emphasis on their integration.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P10.  Note: may be offered on-site, online or blended.  CHYS 3P91  Applications of Behaviour Analysis and Therapy  Use of learning principles, procedures, and concepts to address everyday problems and clinical issues experienced by children, youth and families. Case studies related to developmental disabilities and mental health problems including autism, ADHD and anxiety issues.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA(Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 3P47 or 3P60.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 3P48.  CHYS 3P93  Learning Disabilities: Laboratory  Supervised experience in analysis and evaluation of informal assessment and treatment strategies to be used with children at-risk for learning disabilities.  Lectures, lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 3P20 or permission of the Department.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 3P21.  CHYS 3P94  Childhood, Youth and Equity Issues  Research on contemporary children and youth focusing on how age and generation intersect with social class, race and gender. Topics include children's rights, child poverty and equity strategies.  Lectures, seminar\/lab, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  CHYS 3P95  Childhood and Youth Through the Ages  Historical conceptions of children, childhood, youth and development, and their relation to contemporary theory and research.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): one of CHYS 2P10, 2P38, SOCI 2P38.  CHYS 3P96  Racism and Constructions of Race  Historical and current construction and effects of race and ethnicity in the lives of children and youth in Canada and globally.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): one of CHYS 2P10, 2P38, SOCI 2P38.  CHYS 3P97  Children and Youth in Indigenous Communities  Multidisciplinary exploration of North American and International perspectives on children and youth in Indigenous communities.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): one of CHYS 2P10, 2P38, SOCI 2P38.  #CHYS 3P98  Domestic and Intimate Violence  (also offered as CRIM 3P98 and SOCI 3P98)  Critical overview of theories of and legal responses to family and intimate violence. Research on these forms of abuse and response of police, the courts and other components of the social and legal system.  Lectures, seminar, 3 hours per week.  Restriction: students must have a minimum of 7.0 overall credits or 2.0 SOCI credits above SOCI 1F90.  Prerequisite(s): SOCI 1F90.  Completion of this course will replace the previous assigned grade and credit obtained in CHYS (SOCI) 3P83.  CHYS 3P99  Contemporary Issues in Childhood and Youth Studies  Contemporary issues in child and youth studies. Topics vary depending on current events and on-going debates and across socio-cultural, exceptionalities and developmental perspectives.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): one of CHYS 2P10, 2P35, 2P38, SOCI 2P38.  CHYS 3Q90  Directed Studies  Program of study or research practicum not available among the regular course offerings, designed in consultation with the faculty member directing the course.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 7.0 overall credits and approval of the co-ordinator.  Note: arrangements must be agreed upon with the co-ordinator prior to registration. Normally taken in conjunction with an honours thesis.  CHYS 3Q91  Young Offenders and Youth Justice  Multidisciplinary perspectives in understanding youth in conflict with the law. Role of macro factors in the commission of offences, including unemployment, systemic discrimination based upon gender, race and sexuality, and media constructions of youth.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. After that date open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors, GHUM and SOSC students until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 3P40.  #CHYS 3Q96  Children and Youth at Work  (also offered as LABR 3Q96)  Multidisciplinary exploration of North American and international perspectives on child labour and youth in the labour market.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and LABR (single or combined) majors until date specified in Registration guide.  Prerequisite(s): one of CHYS 1F90, one LABR credit numbered 1(alpha)90 to 1(alpha)99, SOCI 1F90.  Note: may be offered on-site, online or blended.  CHYS 3V40-3V99  Special Topics Seminar  The topic will vary depending on the needs of the program and availability of a faculty instructor.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 8.0 overall credits.  CHYS 3V55  2020-2021: Developmental Neuropsychology of Exceptionalities  Foundational exploration of brain development and functioning in children and youth with neurological and psychological exceptionalities. Topics may include typical and atypical brain development, basics of neuropsychological assessment and intervention, and consequences (cognitive, affective, behavioural, educational) of neurological and psychological exceptionalities associated with birth-related and traumatic brain injuries, paediatric multiple sclerosis, ADHD, and learning disabilities.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), CHHS, CHLH majors and CHYS minors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2P35.  CHYS 3V85  2020-2021: Professional Topics in Child and Youth Studies  Practical, ethical, and legal issues involved in working with children and youth. Topics may include post-degree training and professional programs, professionalism, research and clinical ethics, privacy legislation, self-presentation, standards of professional practice and delivery of services in a variety of contexts, including applied and research settings.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors until date specified in Registration guide. Students must have a minimum of 7.0 overall credits.  Prerequisite(s): CHYS 2F15 or 2P15.  CHYS 3V92  2020-2021: Executive Functions in Children and Youth  Self-regulation of behaviour in the context of typical and atypical development, emphasizing assessment, intervention and prevention. Topics may include the development of executive functions from infancy through early adulthood and their impact on educational achievement, daily life, mental health and wellness.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P10 or 2P35.  CHYS 3V93  2020-2021: Addiction in the Family  Biological, historical, psychological, behavioural, and sociocultural aspects of addictions with a particular focus on how families impact and are impacted by addiction. Topics may include the nature and structure of families, models and theories of addiction, etiology of addictions, assessment and diagnosis, contemporary research in the field of addictions, and different approaches to treatment and recovery.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P10, 2P35, or 2P38.  CHYS 3V94  2020-2021: Children's Participation  Practices, theories, controversies and contemporary issues in young people's participation, including tension between participation and protection. Topics may include children\u0092s involvement in decision-making; cultural contributions; involvement in production and consumption; and children\u0092s activism.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and CHHS, CHLH majors until date specified in Registration guide. Students must have a minimum of 8.0 overall credits.  Prerequisite(s): CHYS 2P10, 2P35 or 2P38.  CHYS 4F80  The Disciplinary Continuum  Uni-, to inter-, to trans-disciplinarity approaches in the study of current topics related to childhood and youth such as self-regulation, bullying, exceptionalities, risk-taking, peer cultures, popular culture, and rights.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: may be offered on-site, online or blended. Students may not concurrently register in CHYS 4F95 or 4F99. Students must hold a 70 percent overall average in CHYS 3P10 and 3P15.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4F95 and 4F99.  CHYS 4F95  Applied Research Project  Involving students in community-based or faculty research projects focusing on service-learning principles, partnerships and diverse deliverables.  Restriction: open to CHYS (single or combined) majors with a minimum of 14.0 overall credits, approval to year 4 (honours) and permission of the Department.  Prerequisite(s): CHYS 3P10 and 3P15.  Corequisite(s): CHYS 4P70.  Note: students may be required to make arrangements for a police check, including a vulnerable sector screening. Students must hold a minimum 75 percent overall average in CHYS 3P10 and 3P15.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4F80 and 4F99.  CHYS 4F99  Honours Individual Thesis  Research project carried out under the supervision of a faculty adviser.  Restriction: open to CHYS (single or combined) majors with a minimum of 14.0 overall credits, approval to year 4 (honours) and permission of the Department.  Prerequisite(s): CHYS 3P10 and 3P15.  Corequisite(s): CHYS 4P70.  Note: students must hold a minimum 75 percent overall average in CHYS 3P10 and 3P15.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4F80 and 4F95.  CHYS 4P01  Development of Self and Identity  Multidisciplinary exploration of the development of self and identity in childhood and adolescence, focusing on classic and contemporary theoretical frameworks. Topics include distinction between self-as-subject and self-as-object, unity versus multiplicity in the self, and social construction of selfhood.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P02  Peer Cultures  Survey of peer cultures emphasizing social structural and interpretive understandings of peer group formation and their impact on child and youth identity.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P03  Approaches to Family Assessment and Intervention  Theoretical, research and clinical issues pertaining to assessment and intervention with families. Interventions include parent training and family counselling. Focusing on early identification and intervention.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum or 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P04  Early Intervention and Prevention Systems  Examination of community and organizational systemic factors contributing to the prevention of problems, and aiding in early intervention in the lives of children and youth with special needs. Focus on the development and evaluation of community programs.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P06  Children in War Zones  Physical, social and psychological consequences of modern warfare on children as both victims and combatants.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P07  Issues in Multiculturalism  Policy and practice around multiculturalism in Canada and globally. Topics include educational policy, developing perceptions of multiculturalism, cultural diversity and intercultural relations.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P08  Companion Animals and Children and Youth  Multidisciplinary consideration of the role of companion animals in the social and emotional lives of children and youth. Topics may include animal\/child abuse, disability and therapy, empathy and self-esteem, coping and resilience, and sociocultural perspectives.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P09  Disability Studies  Critical interdisciplinary exploration of disability as a social, cultural, historical, and political phenomenon. Challenges popular representations of disability as a personal tragedy or individual problem to be fixed and critically assesses the ways disability is conceptualized in societal institutions (e.g., schools). Topics may include the disability\/impairment distinction, inclusion, disability identity, and forms of disability activism.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P10  Counselling and Helping Relationship Praxis  Theories and skills appropriate to a variety of interviewing and helping professional roles and responsibilities. Core skills associated with attending, responding, exploring and terminating stages emphasized within the context of relationship-building pertaining to child and youth studies, education, career, social services, health and general human management needs, and concerns.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4V10.  CHYS 4P16  Children, Youth and Globalization  Political-economic and postmodern perspectives on globalization and its effect on children and youth.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major, a 70 percent overall average in CHYS 3P10 and 3P15, average and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P20  The Worried Mind: Anxiety and Cognitive Functions  Influence of worry\/anxiety on cognitive functions in children and youth. Theories and models of anxiety in the context of typical and atypical neurodevelopment of cognitive functions, socio-emotional manifestations of cognitive dysfunctions related to anxious situations.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  Completion of this course will replace the previous assigned grade and credit obtained in CHYS 4V01.  CHYS 4P22  Theory for Social Change in the Lives of Young People  Radical, emancipatory socio-cultural theories that challenge and rethink the established social order. Topics may include resistance, activism, revolution and dramatic rethinking of the institutions and rules that structure the lives of children and youth.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P25  The Social Origins of Children's Minds  Investigation of traditional and contemporary approaches highlighting the links between social, cultural, historical and institutional settings, and the development of mental processes.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major, a 70 percent overall average in CHYS 3P10 and 3P15, average and a minimum of 14.0 overall credits may be able to register. Contact the Department.  Completion of this course will replace previous assigned grade and credit obtained in CHYS 4V06.  CHYS 4P30  Human Rights and Disability  Theoretical and applied issues related to the promotion and protection of human rights for persons with disabilities. Topics may include the United Nations Convention on the Rights of Persons with Disabilities, Accessibility for Ontarians with Disabilities Act, implications for inclusive education, person centred service planning and self advocacy.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P35  Advanced Topics in Children and Youth with Exceptionalities  Contemporary issues of social policy and practice affecting the exceptionalities of children and youth.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P36  Theoretical and Practical Issues in Conflict Resolutions  Sociocognitive examination of theories and evidence-based practices of conflict resolution interventions. Focus on traditional and recent transformative approaches to resolving peer relational difficulties, and developmental outcomes of functional and dysfunctional resolution.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: CHYS 3P36 highly recommended. With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  *CHYS 4P38  Advanced Topics in Childhood, Youth and Society  (also offered as SOCI 4P38)  Canadian and international research on childhood and youth in changing societies. Topics include globalization of childhood and youth, child labour, child welfare and Canadian policy.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior) and SOCI (single or combined) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P39  Sentencing and Punishment of Youth  Philosophical and legal foundations, objectives and process of sentencing and punishment of young offenders in Western societies. Gaps between sentencing theory and practice, and issues such as the roles of plea bargaining, mitigating and aggravating factors, victims, and adult sentences for youth.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Prerequisite(s): CHYS 3P39 or 3Q91 (3P40).  Note: CHYS 3P39 recommended. With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P41  Risk-Taking in Youth  Topics may include youth lifestyle choices, problem behaviour theory, risk and protective factors, competence, and developmental pathways in the context of community, family, peer, and intrapersonal factors.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P44  Advanced Topics in Gender and Sexuality  Theories of gender and sexuality. Development of gender and sexual identities. Historical and cross-cultural investigations, institutional patterns, representations and inequality.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Prerequisite(s): CHYS 2P38 or SOCI 2P38.  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P45  The Moral Child  Current theories and practices related to moral engagement and disengagement in young people. Multidisciplinary focus on the development of morality in children and youth. Topics may include socialization processes, evolutionary pressures and brain science.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14. overall credits may be able to register. Contact the Department.  CHYS 4P48  Advanced Topics in Behaviour Analysis and Therapy  Use of behaviour analysis and related approaches, including cognitive behaviour therapy, to support individuals with autism and other disabilities and mental health issues.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Prerequisite(s): CHYS 3P47 or 3P60.  Note: With major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P50  Trauma and Abuse in the Lives of Children and Youth  Issues in identification, prevention and intervention in trauma and abuse of children and youth. Systemic analysis focusing on family, school and social influences on prevention and recovery.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  #CHYS 4P56  Maturation and Development  (also offered as PSYC 4P56)  Influences of brain maturation on psychological development and vice versa, and the implications for behaviour.  Lectures, seminar, 3 hours per week.  Restriction: open to CHYS (single or combined), CHYS BA (Honours)\/BEd (Primary\/Junior), NEUR and PSYC (single or combined) majors until date specified in Registration guide. Students must have a minimum of 13.0 overall credits or 5.0 PSYC credits above PSYC 1F90.  Prerequisite(s): one of CHYS 2P10, PSYC 2P12, 2P35, 2P36.  CHYS 4P65  Minds in Transition  Advanced contemporary issues in the development of thinking. Topics may include the development of executive functions, theory of mind, memory, problem solving, creativity, moral reasoning and thinking about the social world.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits and approval to year 4 (honours).  Note: CHYS 3P65 recommended. With Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4P70  The Craft of Research  Advanced issues in the planning, production and (re)presentation of research on children and youth. Topics include formulating research questions, addressing ethical concerns and writing research results.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) majors with a minimum of 14.0 overall credits, approval to year 4 (honours) and permission of the Department.  Prerequisite(s): CHYS 3P10 and 3P15.  Corequisite(s): CHYS 4F95 or 4F99.  Note: students not in Individual Thesis or Applied Research Project streams may register. Contact the Department.  CHYS 4Q90  Directed Studies  Program of study or research practicum not available among the regular course offerings, designed in consultation with the faculty member directing the course.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum of 14.0 overall credits, approval to year 4 (honours) and approval of the co-ordinator.  Note: arrangements must be agreed upon with the co-ordinator prior to registration. Normally taken in conjunction with an honours thesis.  CHYS 4V00-4V10  Advanced Special Topics  CHYS 4V02  2020-2021: Children, Youth and Climate Change: Transdisciplinary Approaches  Present and potential role of children and youth in understanding and critically responding to environmental disruption associated with human activity in the current geological age of the Anthropocene. Focuses on current debates and activism surrounding climate change and other environmental issues bearing on young people and their futures.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA (Honours)\/BEd (Primary\/Junior) majors with a minimum 14.0 overall credits and approval to year 4 (honours).  Note: with Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.  CHYS 4V03  2020-2021: Childhood, Art and Aesthetic Expression  Complex acts of symbolization and expression contained in children's art and art about children, including drawing, painting, photography, film, and literature. Topics may include art therapy with children, exhibitions of children's art, arts-based research methods, and the uses of art during and after social conflict.  Seminar, 3 hours per week.  Restriction: open to CHYS (single or combined) and CHYS BA(Honours)\/BEd (Primary\/Junior) majors with a minimum 14.0 overall credits and approval to year 4 (honours).  Note: with Major CHYS students with a minimum 70 percent major average, a 70 percent overall average in CHYS 3P10 and 3P15, and a minimum of 14.0 overall credits may be able to register. Contact the Department.",
    "2": null
  },
  {
    "0": null,
    "1": null,
    "2": null
  }
]