[{
   "name": "Active Mental Health Initiative",
   "club_contact": "amhi.awareness@gmail.com",
   "club_description": "Welcome to the Active Mental Health Initiative! We are a student-run club at Brock University focused on creating awareness around the benefits of physical activity on mental health! Our goal is to break the stigma surrounding these two aspects of life, and in the process, aid those suffering with mental illness via charity fundraising and physical activity."
  },
  {
   "name": "American Sign Language Club",
   "club_contact": "brockaslclub@outlook.com",
   "club_description": "The ASL club promotes the awareness of deaf culture in our immediate community. We learn about different types of discourse in ASL and learn introductory ASL sentence structure and vocabulary."
  },
  {
   "name": "Angels without Boundaries",
   "club_contact": "brockuawb@gmail.com",
   "club_description": "To provide resources for education to underprivileged children in developing countries and provide motivation to today's youth to create a better future."
  },
  {
   "name": "Animal Activism Club",
   "club_contact": "brockuaac@outlook.ca",
   "club_description": "We are a club advocating, fundraising and bringing awareness for animal rights. The clubs goal is to give back to animals in need, while gaining insight of what we can do as a community to better our interaction with animals.\nFollow us @brockuaac on Instagram & BrockU Animal Activism Club on Facebook!"
  },
  {
   "name": "Anime",
   "club_contact": "brockanime0@gmail.com",
   "club_description": "The Brock Anime Club is available for all members of the community. We aim to create a fun and entertaining environment for all who enjoy anime, manga, costumes and cosplaying; or have a general interest in Japanese Culture."
  },
  {
   "name": "Badgers Against Homelessness",
   "club_contact": "brockubah@gmail.com",
   "club_description": "A club that advocates for the rights, needs, and problems homeless people face, to educate people on all of these things, and to raise money for local shelters and participate in other related philanthropies."
  },
  {
   "name": "Baking at Brock",
   "club_contact": "bakingatbrocku@gmail.com",
   "club_description": "The Brock Baking Club is an environment for students to be able to experience something new and take a break from academics! Club also provides an opportunity for new bakers to learn new techniques and for others to show off their skills!"
  },
  {
   "name": "Bangladeshi Students' Association",
   "club_contact": "brockubsa@gmail.com",
   "club_description": "Bangladeshi Students’ Association at Brock University exists to promote and celebrate Bangladeshi culture and heritage to the student community. Along with creating a supportive community for Bengali students on campus, our motto is to collaborate with other cultural clubs on campus via means of creative arts and provide assistance to Bangladeshi students with their transition to Canada as well as their continued journey at Brock."
  },
  {
   "name": "Best Buddies Brock",
   "club_contact": "bestbuddiesbrock@outlook.com",
   "club_description": "Best Buddies is a global volunteer movement that creates opportunities for one-to-one friendships and leadership development for people with intellectual disabilities. Our Best Buddies Chapter at Brock partners with Community Living St. Catharines. Our club promotes social inclusion and provides opportunities to become involved in the St. Catharines community! Brock students have the option of becoming a Peer Buddy or an Associate Buddy."
  },
  {
   "name": "Big Question Club",
   "club_contact": "bigquestionsbu@gmail.com",
   "club_description": "Big questions is a club devoted to discussing difficult concepts for a better understanding on so called \"big questions\" regarding issues on society, philosophy, religion, politics, science etc. We foster on inquisitive and intellectual atmosphere at Brock that bridges the gap between class learning and life experience."
  },
  {
   "name": "Black Student Association",
   "club_contact": "brockblsa@gmail.com",
   "club_description": "\"Our mission statement for the Black Student Association is"
  },
  {
   "name": "Brock Euchre Club",
   "club_contact": "euchreclubBU@gmail.com",
   "club_description": "An inclusive club for card game lovers. Euchre is primarily played, including monthly tournaments. If you know know how to play euchre and want to meet likeminded students, this is the club for you."
  },
  {
   "name": "Brock Biological Society",
   "club_contact": "brockbiologicalsociety@gmail.com",
   "club_description": "The purpose of the Biological Society is to support students in biology and related fields. Throughout the year we provide opportunities for students to engage in academic enrichment and develop relationships with their peers."
  },
  {
   "name": "Bollywood Dance Club",
   "club_contact": "brockunaach@gmail.com",
   "club_description": "BROCKUNAACH is a brock university club based around bollywood/bollywood fusion dance and culture. We aim to teach brocku students different bollywood dances with the hopes of competition or participating in fun events."
  },
  {
   "name": "Campus Conservatives",
   "club_contact": "brockutories@outlook.com",
   "club_description": "The Brock Campus Conservatives are a political club which promotes conservative values and policies, in addition to promoting the policies of Conservative Party of Canada and of the Progressive Conservative Party of Ontario, as well as their affiliated candidates. We also provide a forum for students who identify as Conservative or have sympathies to Conservatism and/or Conservative parties to discuss and share their beliefs with like-minded peers. We also host and promote events and activities to discuss politics and how they affect us as young adults."
  },
  {
   "name": "Cam's Kids Foundation",
   "club_contact": "camskids.brock@gmail.com",
   "club_description": "Cam’s Kids is committed to “Supporting Young People Struggling with Anxiety” by:"
  },
  {
   "name": "Canadian Association for Global Health (Brock University Chapter)",
   "club_contact": "brockcagh@gmail.com",
   "club_description": "CAGH is an active network of individual and organizational members coming together to improve global health, health equity and systems strengthening in Canada and worldwide. The Brock University Chapter for CAGH aims to create a diverse and committed community of students with a unified voice to shape Canada’s role in addressing critical global health priorities. Joining CAGH is a great way to stay informed about various global health issues."
  },
  {
   "name": "Canadian Association for Global Health (Brock Uni Chapter)",
   "club_contact": "brockcagh@gmail.com",
   "club_description": "CAGH is an active network of individual and organizational members coming together to improve global health, health equity and systems strengthening in Canada and worldwide. The Brock University Chapter for CAGH aims to create a diverse and committed community of students with a unified voice to shape Canada’s role in addressing critical global health priorities. Joining CAGH is a great way to stay informed about various global health issues."
  },
  {
   "name": "Canadian Nursing Students Association",
   "club_contact": "brock@cnsa.ca",
   "club_description": "Brock CNSA is the primary resource for legal, emical, professional, educational, and social aspects for Brock nursing students. This club is an opportunity for Brock nursing students to influence and advance innovation and social justice in the nursing curriculum and the nursing profession. This club strengthens images and creates new partnerships between Brock nursing students, to local, provincial, and national nursing students and health organizations. Our goal is to send as many Brock nursing students as possible to the CNSA regional and national conferences to furthers strengthen these linkages."
  },
  {
   "name": "Cancer Awareness Society",
   "club_contact": "brockcas@outlook.com",
   "club_description": "Our club focusses on raising cancer awareness in the Brock community and promoting resources and organizations in the Niagara Region. We hope to raise awareness through social media and events for Brock students. Cancer awareness and community advocacy are very important topics we would like to shine a light on!"
  },
  {
   "name": "Catholic Students' Association",
   "club_contact": "brockcatholic@outlook.com",
   "club_description": "The Brock Catholic Students' Association (BCSA) is a student-run club that works to create an inviting Catholic community. Our mission is to bring together students and community members who wish to explore their faith, spirituality, and their relationship with Jesus. We organize social events, Sunday Mass, faith formation, adoration, and other initiatives to help bring the sacraments to campus as well as foster solidarity. Our programs and events are designed to involve more students in the faith and reawaken spirituality at Brock."
  },
  {
   "name": "Champions of Change",
   "club_contact": "brockucc@gmail.com",
   "club_description": "Champions of Change clubs promote gender equality and challenge harmful social norms through peer-to-peer mobilization. We will champion girls' rights and gender equality by raising awareness, advocating and fundraising for plan international's Because I am a Girl movement"
  },
  {
   "name": "Chess Club",
   "club_contact": "brockchessclub@gmail.com",
   "club_description": "A club for the casual or tournament chess player. We hope to develop and promote chess culture at Brock in order to inspire and help players of all levels to reach their potential."
  },
  {
   "name": "Chinese Students' and Scholars Association",
   "club_contact": "president.bucssa@gmail.com",
   "club_description": "BUCSSA is mostly responsible for helping away from-home Chinese in their life, study and other isue. BUCSSA also serves as bridge between the Chinese and other communities, promoting Chinese Culture. Main activities= Mid-Autumn Festival, Sport Night, Orientation for new arrivals and seasonal activities"
  },
  {
   "name": "CHYS Association",
   "club_contact": "brock.chys@gmail.com",
   "club_description": "The CHYS Association is a great way to enhance your university experience! As representatives of the Department of Child and Youth Studies, the club executives use its interdisciplinary approach to prepare events that provide opportunities for leadership, academic organization and development, as well as volunteer experiences. By becoming a CHYS Association member, you will enhance your academic experiences through interaction with other CHYS students, professors, staff and the community at large."
  },
  {
   "name": "Christian Fellowship",
   "club_contact": "brockchristianfellowship123@gmail.com",
   "club_description": "We are a group dedicated to growing in community and in our relationship with God. Through conversations, outreach, worship, bible studies, and prayer we grow deeper in our passion for Jesus and find out more about our faith"
  },
  {
   "name": "Climbing and Bouldering Club",
   "club_contact": "brockclimbingandboulderingclub@gmail.com",
   "club_description": "The Brock Climbing and Bouldering Club is a club dedicated to bringing together students of all skill levels to join the climbing community. Our club provides a welcoming environment where student health and fitness is supported and encouraged. We aim to provide club members with the opportunities to problem-solve, develop collaborative skills, challenge themselves and others, and belong to an inclusive community that shares a general interest in rock climbing and bouldering."
  },
  {
   "name": "Commerce and ECON Association",
   "club_contact": "president.bucea@gmail.com",
   "club_description": "Brock University Commerce and ECON Association (BUCEA) is a student-run organization dedicated to enhancing the experience of all students who are interested in subjects of Economics and Commerce. We aim to provide a platform for members to engage in academic and social settings outside of the classroom. BUCEA holds a series of events to assist members in learning about the academic and career opportunities at Brock University. Events such as Meet the Faculty, Alumni Guest Lectures, Local Job Information, provide members the opportunity to build their networks as well as professionals."
  },
  {
   "name": "Concurrent Education Student Association",
   "club_contact": "info@brockconed.com",
   "club_description": "We are Brock's Concurrent Education Student Association, otherwise known as CESA! We’re a group of future teachers looking to make a difference both at Brock and in our local community. As one of Brock’s biggest clubs, we are committed to getting you involved in so many opportunities both inside and outside of Brock. We plan various events for Con Ed Students that focus on working with children, professional development, and networking with others in the program, and all are a great way to meet other people in the program! Be sure to follow us on Instagram and Facebook @brockconed for all of the latest updates and to keep up with what we do! If you have any questions, feel free to reach out to us there, or email us at info@brockconed.com"
  },
  {
   "name": "Crafting for a Cure",
   "club_contact": "brockcfc@outlook.com",
   "club_description": "Brock University chapter of Crafting for a Cure, a not-for-profit charity that looks for opportunities to ensure children are having a positive experience when a hospital visit necessary"
  },
  {
   "name": "Creeds on Campus",
   "club_contact": "brockcreedsoncampus@gmail.com",
   "club_description": "Creeds on Campus is a spiritual club which aims to promote diversity and inclusivity in spaces for students while fostering and developing stronger understandings between communities."
  },
  {
   "name": "Cybersecurity Club",
   "club_contact": "cybersecbrock@gmail.com",
   "club_description": "Brock’s Cybersecurity Club aims to raise awareness about cybersecurity and expand the comprehension of security issues beyond the classroom with workshops hosted monthly, free resources to assist with career paths, news, articles, guest speakers, external security events as well as hackathons to participate in. Our club is also open to students from all programs (no experience required) so make sure to sign up!"
  },
  {
   "name": "Dance",
   "club_contact": "brockdance5678@gmail.com",
   "club_description": "Brock Dance provides all students with recreational classes in the Beginner to Advanced levels in styles such as Lyrical, Hip Hop, Jazz, Tap and Musical Theatre to perform in the Year-End Recital. Brock Dance also runs a Competitive Dance team that competes in three university competitions in the Winter."
  },
  {
   "name": "Eco Society",
   "club_contact": "brockecosociety@gmail.com",
   "club_description": "Brock Eco Society is a place where students can meet like-minded individuals who have a passion for preserving the environment. The club tackles a variety of environmental issues while still providing an atmosphere for students to have fun while de-stressing from school.\""
  },
  {
   "name": "English Students' Association",
   "club_contact": "brocku.esa@gmail.com",
   "club_description": "Connecting English students to the department, community and helping students achieve both academic and social success during their time of Brock!"
  },
  {
   "name": "Esports",
   "club_contact": "brockesports@gmail.com",
   "club_description": "Brock eSports is a gaming community where students come to compete and engage in discussion of video games. Our goal is to create a team that will compete at a high level through inter-collegiate competition."
  },
  {
   "name": "Faculty of Applied Health Sciences Mentorship Program",
   "club_contact": "brockfahsmentorship@gmail.com",
   "club_description": "A student mentorship program designed to guide first-year students in the FAHS transition from high school to Brock University. The FAHS mentorship program brings together students mentees and mentors from each department to aid in professional development, networking, and career exploration. This program will offer incoming students the opportunity to get involved with our community and learn all the essential information to maximize their experience at Brock. The program involves face-to-face mentoring, networking events and connections to career development resources."
  },
  {
   "name": "Faculty of Math and Science Council",
   "club_contact": "brockufmsc@gmaill.com",
   "club_description": "Description: The Faculty of Math and Science Council represents the students in our faculty. The Council encourages participation as well as involvement within our department. With this, the Council hosts engaging, professional, and recreational events for the students."
  },
  {
   "name": "Filipino Students Association",
   "club_contact": "bfsabrocku@gmail.com",
   "club_description": "With Brock's blooming diversity, we wanted to provide Filipino representation for the student body, therefore, BFSA is designed to spread and promote awareness of Filipino culture. Not only do we aim to generate a vibrant Filipino presence on the Brock map, but we want to support the Brock community and the local Filipino community. While the name seems limited to Filipino students only, we are an all-inclusive group that is welcoming to anyone interested! When you join BFSA, you are not only a member, but you are a part of a family."
  },
  {
   "name": "First Love Centre - B rock University",
   "club_contact": "flc.stcatharines@gmail.com",
   "club_description": "First Love Center, Brock University is a religious club that encourages students to develop a strong personal relationship with Jesus Christ whilst studying at the University. The club develops students' diverse talent and leadership skills and provides a loving community where students are encouraged spiritually, emotionally, and academically. The club also develops students' knowledge on the charismatic Christian denomination and values, through teaching and promoting spiritual well-being which has a positive effect on mental, physical, and emotional health."
  },
  {
   "name": "French Club",
   "club_contact": "brockfrenchclub@gmail.com",
   "club_description": "Our club focuses on providing an out-of-class opportunity for Brock students to learn and practice speaking French, while also engaging in French culture through various planned events and activities."
  },
  {
   "name": "FOCUS Club at Brock",
   "club_contact": "Brock.focus@gmail.com",
   "club_description": "FOCUS (Friendship for Overseas College & University Students) Club at Brock is a group comprised of Brock students with support from some members of the local community in Niagara. The club’s aim is to warmly welcome and support International students from every ethnic and religious background. We also seek to equip and encourage Canadian students to provide support and friendship to international students, to help them with their studies and in their adjustment to Canadian culture."
  },
  {
   "name": "Game Research & Development",
   "club_contact": "gamedevelopmentresearch@gmail.com",
   "club_description": "This club aims to prepare students looking to join the gaming industry by having a business-like approach. It allows members to express their creativity and skill through discussion and experimentation."
  },
  {
   "name": "Ghana Association",
   "club_contact": "bugaadmin@gmail.com",
   "club_description": "To serve as the official mouthpiece for the Ghanaian Community here at Brock. Provide socialization and other cultural festivities aimed at minimizing cultural shock for members, particularly, new Ghanaian students. Provide various support services to members including but not limited to academics, welfare, and leadership training."
  },
  {
   "name": "Global Medical Brigade",
   "club_contact": "brockmedgb@gmail.com",
   "club_description": "Brock Global Medical Brigade is a volunteering club that works with Global Brigades under the medical sector to help implement a holistic model into remote, rural, and under-resourced communities in Latin-American and African countries. Students will be learning about these communities, the way they live, and how to help them medically and socially; they will also be fundraising and finding resources/supplies for these communities throughout the year. At the end of the year students have the opportunity to go on an optional medical brigade to one of these communities where students will gain hands-on experience in the field and shadow licensed healthcare professionals as they consult community members on their health needs and prescribe medication. Student volunteers will have the opportunity to intake patients, perform triage, distribute medication under licensed pharmacists, and facilitate preventative medicine workshops. Volunteers will also work with families on public health projects, including eco-stoves and hygiene stations, to help prevent illnesses and improve sanitation and hygiene. This is a great opportunity to gain experience in working in the medical field, helping others around the world, and maybe even learn a new language."
  },
  {
   "name": "GoLive",
   "club_contact": "golivebrocku@gmail.com",
   "club_description": "is a live music club at Brock University that aims to connect people through music. Our Club strives to promote all student participation in the contribution and enjoyment of their musical abilities and talents, providing an outlet for every student interested in music. GoLive serves as a unique experimental learning platform for passionate singers, beatboxers, rappers etc. to take part in organized jam sessions, live music events and a variety of guest speaker presentations that works towards bringing like-minded people together to explore their talents, strengthen their bonds and work hard towards reaching far and beyond the expected. This club is the first of its kind here at Brock and is not affiliated with any other club/organization.\nIf interested, please feel free to reach out:\nE-mail: golivebrocku@gmail.com\nInstagram: @golivebrocku\nFacebook: GoLive"
  },
  {
   "name": "Gujarati Student Association",
   "club_contact": "brockugsa@gmail.com",
   "club_description": "The Brock Gujarati Student's Association (GSA) is a student-run club for Gujarati, along with anyone who would like to interact with each other and celebrate Gujarati culture. In this club, we want to inspire friendship, happiness, harmony amongst all, along with spreading the culture and traditions of Gujarat to the Brock community.\nInstagram: @ brockugsa\nFacebook: @brockugsa"
  },
  {
   "name": "Health Magazine",
   "club_contact": "brockhealth@gmail.com",
   "club_description": "Brock Health is a student run academic magazine based out of Brock University.Undergraduate students are encourage to submit articles on a topic related to health or a current breakthrough in the field. Topics cover all aspect of health, including spiritual, emotional, and physical health. All information in the articles comes from credible journal articles written by researchers in the field, and articles are edited for quality and accuracy by graduate students."
  },
  {
   "name": "Health Science Council",
   "club_contact": "brockhlsccouncil@gmail.com",
   "club_description": "We invite all students in the Department of Health Sciences (Child Health, Community Health, Medical Sciences, Public Health) to join the Health Sciences Council! The Brock Health Sciences Council hosts meetings and events with the goal of connecting Health Sciences students and promoting academic success, professional networking, and involvement both on campus and in the community!"
  },
  {
   "name": "Heart and Stroke Foundation Club",
   "club_contact": "BUheartandstroke@gmail.com",
   "club_description": "Brock University Heart and Stroke Foundation chapter (BUHS) seeks to raise awareness and funds for the thousands of people affected by heart conditions. Our goal is to instill an appreciation for the organization to ensure committed donors continue to support for many years to come through action and words."
  },
  {
   "name": "Hellenic Students' Association",
   "club_contact": "brockhellenicsa@gmail.com",
   "club_description": "The Hellenic Students' Association (HSA) is a student run group at Brock University. The HSA is for all Hellenes, Phil-Hellenes and for those who enjoy the Greek culture. Our mission is to bring students together as often as possible to celebrate, share and preserve the rich Greek culture within our university life."
  },
  {
   "name": "Hercampus at Brock U",
   "club_contact": "hc.brocku@hercampus.com",
   "club_description": "A Lifestyle magazine covering topics like wellness, culture, politics, sex and relationships, beauty and style."
  },
  {
   "name": "HOSA",
   "club_contact": "brockuhosa@gmail.com",
   "club_description": "HOSA is a club designed for students wanting to pursue a career in the health care field. As a HOSA member, students are provided with opportunities to learn about specific healthcare careers of interest to them as well as the healthcare industry as a whole by preparing for and competing in one of 30 unique competitive events."
  },
  {
   "name": "Brock Improv",
   "club_contact": "brockimprov@gmail.com",
   "club_description": "Brock Improv Club is a wonderful venue for those who like to live in the moment! We offer causal, and competitive imrpv as well as workshops designed for those hoping to learn new skills or improve upon existing ones. Open to performers and spectators alike!"
  },
  {
   "name": "Inclusive Communities of Canada",
   "club_contact": "brock@inclusivecommunitiescanada.org",
   "club_description": "Our mission is to inspire change and promote inclusion among children/youth in the Niagara community. Inclusive Communities Canada - Brock acts to advocate for inclusion of children/youth of all abilities in education, community programming and recreation. We will seek to do this through hosting events to spread awareness and raise money for our programs, partnering with local community centres, and offering resources to encourage inclusion for children/youth."
  },
  {
   "name": "Indian Student Association",
   "club_contact": "Isaclub2019@gmail.com",
   "club_description": "Indian Student Association will display all the varieties of Indian Culture.\nEveryone at Brock is welcome to join the club and be the part of events that we will be hosting. It will be of great help for the new International students as they will have a club where they can ask questions to the students who have experienced Brock Life for some time."
  },
  {
   "name": "Institute of Healthcare Improvement Open School Chapter",
   "club_contact": "brockihi@gmail.com",
   "club_description": "Our club focuses on educating individuals on quality improvement (QI), and connecting like-minded individuals who are striving for a career in healthcare. Members have the opportunity to participate in QI based research projects, and network with industry professionals at our annual conference. We typically hold meetings/workshops about once or twice a month, where members are able to further develop connections and increase their knowledge of QI."
  },
  {
   "name": "Jack.org",
   "club_contact": "brockujack.org@gmail.com",
   "club_description": "A groups of young people working year-round to identify and dismantle barriers to positive mental health in their communities. The focus of this group is empowering youth to advocate and the change for youth mental health."
  },
  {
   "name": "Jews at Brock- Chabad on Campus",
   "club_contact": "jewsatbrock@gmail.com",
   "club_description": "To provide a space for where everyone is welcome to learn about the Jewish culture by providing a welcoming community to celebrate Jewish holidays and traditions with other students. To provide a group where students socialize in a comfortable setting with great friends and stimulating discussion."
  },
  {
   "name": "Kinesiology Student Association",
   "club_contact": "brockksa@gmail.com",
   "club_description": "The Kinesiology Students' Association (formerly Kinesiology Council) was founded in 2015 to bring a feeling of community and togetherness to the Department of Kinesiology at Brock.\nThe mission and vision of the KSA is to provide students with opportunities to enhance their academic, professional and social development. The Association does so by planning activities, conferences, and more for students of the department to attend in order to build connections and learn a little bit more about the outstanding opportunities Brock Kinesiology has to offer!"
  },
  {
   "name": "Kin Games",
   "club_contact": "brockukg@gmail.com",
   "club_description": "A student run club centered around networking with kin students around the country. Our team competes in academics, sports, spirit, and dance in an education-based weekend conference."
  },
  {
   "name": "K-Pop Club",
   "club_contact": "brockukpop@gmail.com",
   "club_description": "Brocku K-POP club is a community for students who enjoy K-POP and Korean culture. We will be hosting some fun events such as dance cover workshops, live streaming MVs/Korean dramas, trivia night, mukbang event and so much more!"
  },
  {
   "name": "Korean Students' Association",
   "club_contact": "buksa202109@gmail.com",
   "club_description": "Brock University Korean Students Association (BUKSA) is an organization, which was constituted by Korean students to cultivate unity, friendship, and growth among Korean students at Brock University. Amongst the members of UWKSA, we generate an environment where members can share fellowship, and exchange beneficial information throughout campus life."
  },
  {
   "name": "Leaders at Brock",
   "club_contact": "leadersatbrock@gmail.com",
   "club_description": "We visualize an inclusive, accessible and dynamic community at Brock, where students are empowered and encouraged to create sustainable change in their communities as well as their personal, academic and professional lives. We learn from each other and inspire others to grow."
  },
  {
   "name": "League of Legends Club",
   "club_contact": "brockleagueoflegends@gmail.com",
   "club_description": "To build a community of League of Legends, including, but not limited to, viewing parties for competitive events, competition between, with, and against other members, and holding tournaments with members of all skill levels. Members of all skill levels are welcome."
  },
  {
   "name": "Learners Association",
   "club_contact": "brocklearners@gmail.com",
   "club_description": "The Brock Learners Association aims to promote building healthy habits in studying, productivity, self-improvement, and life-long learning in the modern age."
  },
  {
   "name": "Lift Church",
   "club_contact": "info@liftchurch.ca",
   "club_description": "Do you find yourself asking the questions “Who am I?”, “Who are the people influencing me?” and “What is my life for?” Join a Simple Church at one of our campuses and let's answer these questions together.\nWe believe the Church offers the answer to these questions through Jesus."
  },
  {
   "name": "Linguistic Network",
   "club_contact": "brocklingnet@gmail.com",
   "club_description": "A club for Applied Linguistics students to participate in academic, social and community outreach events."
  },
  {
   "name": "Live 4 Dance",
   "club_contact": "live4dance@live.com",
   "club_description": "Live4Dance is a Brock University club that is based around urban Hip-Hop. We are known for our fun and motivational, yet educating environment. Every Monday and Wednesday nights we host dance classes in the dance studio.Guest choreographers come out twice a month to promote growth in all styles of Hip-Hop."
  },
  {
   "name": "Macedonian Students Association",
   "club_contact": "BMSA.Official@outlook.com",
   "club_description": "This club is to gain a sense of community within the Brock community by running events and other fun things. This club is open to all to learn more about the Macedonian culture."
  },
  {
   "name": "Middle Eastern and North African Students' Association",
   "club_contact": "Mena@outlook.com",
   "club_description": "A club for students from the Middle Eastern and North Africa to come together and embrace our culture and express and share their heritage."
  },
  {
   "name": "Magic Club",
   "club_contact": "brockumagicclub@gmail.com",
   "club_description": "We want to create a place to teach and spark interest in magic while also fostering creativity using the art."
  },
  {
   "name": "Malayalee Association",
   "club_contact": "brockmalayalees16@gmail.com",
   "club_description": "Brock Malayalee Association (BMA) is a student organization that was formed in 2016, and is geared towards unifying the youth Malayalee community at Brock University and the Niagara region. BMA focuses on hosting events that allow international & first-generation Canadian-Malayalees to interact with each other and celebrate Malayalee culture."
  },
  {
   "name": "Mandarin Chinese Christian Fellowship",
   "club_contact": "BUMCCF@outlook.com",
   "club_description": "Brock Mandarin Chinese Christian Fellowship is a young club that focuses on spreading gospel to Chinese students at Brock. Activities includes but not limit to weekly bible study, academic study gathering, outdoor trip and term retreat. We are eager to bring God to their life by building relationship with them; we also want to improve their physical and spiritual experience during university life. Our long term vision is to let more students in the Niagara Region to know and love God, as well to love one another."
  },
  {
   "name": "Menstruation REDefined",
   "club_contact": "brockredefined@gmail.com",
   "club_description": "Brock’s Chapter of Menstrual REDefined is advocating for menstrual equity on campus and all things diversity, human rights & empowerment!"
  },
  {
   "name": "Mental Health Association",
   "club_contact": "brockmhc@gmail.com",
   "club_description": "The Brock Mental Health Association (BMHA) is not only going to focus on spreading awareness about mental health, but it will also increase student body engagement by providing services, workshops, podcasts, tips and challenges. The main goal of the club is to help students prioritize their mental health. BMHC is going to work to introduce better ways to improve mental health, and provide students with resources that they will need for growth and healing."
  },
  {
   "name": "Model United Nations",
   "club_contact": "munbrock@gmail.com",
   "club_description": "Brock NMUN is an opportunity for students to participate in experiential learning while simulating the United Nations and creating innovative solutions to world problems. Public speaking, resolution writing, and team work skills are developed. Brock NMUN teaches students of all experience levels and academic backgrounds these skills while simulating various UN committees in weekly meetings on-campus."
  },
  {
   "name": "Molecular Research Technologies",
   "club_contact": "bmrt17@gmail.com",
   "club_description": "The Molecular Research Technology club aims to improve and develop a well-established research community at Brock University in the field of molecular biology. We promote scientiﬁc research, specifically in synthetic biology, to undergraduate students who are interested in acquiring lab experience in an inviting environment. MRT will try to work closely with professors and graduate students in the Faculty of Mathematics and Science and will seek out events that will showcase the work performed by the members of this club. Specifically, we will encourage students to compete and represent Brock University at the international synthetic biology competition called iGEM, that is held annually in Boston. Lastly, our goal for the club is to develop a network among synthetic biology laboratories across Ontario and this will foster excellent opportunities for the students to network and meet perspective graduate supervisors and employers. Our meetings are every Wednesdays from 11am- 12pm."
  },
  {
   "name": "Montionball",
   "club_contact": "brocku@motionball.com",
   "club_description": "Motionball is a national non-profit organization that empowers young Canadians to be leaders in their communities, raising funds and awareness for Special Olympics through inclusive social and sporting events. At Brock University, we’re working to ensure that individuals with intellectual disabilities living in St. Catharines are included, supported, and celebrated. We create relevant, meaningful experiences for university students to give back to their community, while building relationships with local Special Olympics athletes."
  },
  {
   "name": "Photography Club",
   "club_contact": "brockphotographyclub@gmail.com",
   "club_description": "A welcoming community for students interested in photography. We aim to teach members valuable tips and techniques for those looking to improve their photography skills and provide opportunities to put new technical knowledge into practice. We also supply photography services to other clubs and offer club members options to take photos commercially for the other clubs or students."
  },
  {
   "name": "Motorsports",
   "club_contact": "brockumotorsports@gmail.com",
   "club_description": "Welcome to Brock Motorsports! If you like cars and watching them being pushed to the limit, then this is the place for you! All members are welcome!"
  },
  {
   "name": "Music & Memory at BrockU",
   "club_contact": "musicandmemory.brocku@gmail.com",
   "club_description": "• The purpose of Music & Memory at Brock University is to promote the therapeutic use of favorite music by helping to support Music & Memory. Music & Memory Inc. is a nonprofit organization dedicated to providing personalized music playlists to help improve quality of life for seniors living with dementia and other types of cognitive loss. By advocating for Music & Memory, we support the adoption of this method as a standard of care throughout the healthcare industry and support the growing network of Music & Memory certified care organizations.\nFollow us on Instagram @musicandmemory.brocku & Facebook-Music & Memory at Brock University"
  },
  {
   "name": "Brock Musical Theatre",
   "club_contact": "brockmusicaltea@gmail.com",
   "club_description": "Brock Musical Theatre is a student run organization devoted to creating quality musical theatre for the Brock and St. Catharines/Niagara communities. Brock Musical Theatre is a ratified club under the Brock University Students' Union. It is not affiliated with the Brock University Department of Dramatic Arts or with any University Department, staff or faculty member. Brock Musical Theatre was created in 2005 to provide all Brock University students with the opportunity to participate in quality musical theatre. Today, the company is open to all Brock Students no matter their major field of study. Brock Musical Theatre has become a showcase for the wide range of talents that the entire Brock University community possesses in the musical field. Brock Musical Theatre is devoted to a healthy, respectful, and positive learning environment where students can learn and achieve hands on experience in all aspects of a musical theatre production. Please visit our Facebook page or Instagram for information about auditions, productions and other events."
  },
  {
   "name": "Muslim Students Association",
   "club_contact": "brockumsadawah@gmail.com",
   "club_description": "A club that exists to create a united from of Muslim students on campus that work to educate the campus about the essence of being Muslim and to create co-existence and respectful dialogue with the campus."
  },
  {
   "name": "Niagara Rotaract Club",
   "club_contact": "brockniagararotaract@gmail.com",
   "club_description": "Brock Niagara Rotaract is a youth humanitarian organization with a mission to create positive change in the local and global community. We organize fundraisers and special events to support education, physical health, mental health, environment and to alleviate poverty at home and abroad. Brock Niagara Rotaract aims to build strong relationships between members and to create a community of like-minded leaders of all demographics, experience levels and areas of study. Join us to become a member of a local group and international organization of change-makers."
  },
  {
   "name": "Niagara Strong at Brock\" (NSBU)",
   "club_contact": "niagarastrongbrocku@gmail.com",
   "club_description": "This club was created in partership with Niagara Strong, a non-profit mental health organization based in the Niagara region. The goals of this club include: To spread awareness and understanding of mental health issues, eliminate the stigma surrounding mental health issues, and ultimately help lessen the amount and degree of suffering caused by mental health issues."
  },
  {
   "name": "Pakistani Students Association",
   "club_contact": "brockupsa@gmail.com",
   "club_description": "The Brock Pakistani Students' Association (BPSA) is a club on campus run by students that organizes events to unite Pakistani students to celebrate and to promote the culture to the greater community at Brock University."
  },
  {
   "name": "Pentecost Students and Associates",
   "club_contact": "pensabrocku@gmail.com",
   "club_description": "The purpose of this club is to bring people of all cultures to the saving knowledge of Jesus Christ and at the same time help members to identify and develop their ministry and leadership potentials on campus."
  },
  {
   "name": "People's Party Club",
   "club_contact": "brockpeoplesparty@outlook.com",
   "club_description": "The Brock People's Party club works to increase support for the People's Party of Canada on campus and in the surrounding area. We strive to promote the values of the party, freedom of speech, and assembly on campus while fostering an atmosphere of civil debate and productive discussion. We serve as a resource for Brock University students and other young Canadians to get involved with the PPC through events, media, networking, and overall political participation."
  },
  {
   "name": "Physicians for Human Rights Brock University Chapter",
   "club_contact": "brockphr@gmail.com",
   "club_description": "The Physicians for Human Rights Brock University Chapter mission is to create a community of future healthcare leaders at Brock university committed to ending human rights violations through careers guided by a human rights framework. The Student Program provides young health professionals with the resources to engage with the larger PHR network to help cultivate skills as advocates for health and human rights locally, nationally, and globally. Through PHR students can network and meet like-minded individuals who are interested in building a health care system and a society that protects the rights of all."
  },
  {
   "name": "Plant-Based at Brock",
   "club_contact": "plantbasedbrock@gmail.com",
   "club_description": "We are an inclusive community for anyone who lives a plant-based, vegan or vegetarian lifestyle, or is interested in learning more about it. Our three pillars; animal welfare, environmentalism and health, are the bases of our activism."
  },
  {
   "name": "Pursuit of Happiness",
   "club_contact": "brockpursuitofhappiness@gmail.com",
   "club_description": "The goal of Pursuit of Happiness is to create a safe environment where we help you achieve your aims by tackling procrastination. Members are provided with customized and solid strategies after understanding the cause of their procrastination, and are given tips on how to build long term healthy habits."
  },
  {
   "name": "Power to Change",
   "club_contact": "p2c.brock@gmail.com",
   "club_description": "Power to Change is a movement dedicated to changing the world by helping students discover Jesus. Our mission is to help students experience God's love and forgiveness and become world changers as they make faith a lifelong commitment."
  },
  {
   "name": "Podcast Club",
   "club_contact": "brockpodcasts@gmail.com"
  },
  {
   "name": "Pride",
   "club_contact": "brockpride@outlook.com",
   "club_description": "Brock Pride is devoted to creating a safe, social environment for students of diverse gender and sexual indentites. We provide a social atmosphere which offers support for members of the pride community and their allies, dealing with relationships, coming out, sexuality and gender issues. We also pursure the advancement of equailty, acceptance and fair treatment of Pride issues such as same-sex marriage, homophobia, transphobia, heterosexism and sexual diversity."
  },
  {
   "name": "Psychology Society",
   "club_contact": "psycsoci@gmail.com",
   "club_description": "The Brock Psyc Society is a social club that holds events in order to unite students with common interests. We welcome all students to attend regardless of their major. In addition, we provide events geared toward psychology majors a relaxed atmosphere to connect with students in all years of their degree."
  },
  {
   "name": "Recharge: Mind & Body Wellness Club",
   "club_contact": "wellnessbrocku@gmail.com",
   "club_description": "\"Take a break from your studies to come meet some wellness buddies!\"\nOur club is passionate about helping students come together and do good things for their mind and body. We offer a variety of wellness activities such as nature walks, yoga, painting, etc. We can't wait for you to join us!\nInstagram: rechargewellnessclub"
  },
  {
   "name": "Brock RECL Council",
   "club_contact": "brockreclcouncil@gmail.com",
   "club_description": "The goal of Brock's RECL (Recreation & Leisure Studies) Council is to provide RECL students with an opportunity to get to know each other outside of the classroom, provide support and resources to be successful in their academics, and promote the philosophies of RECL practices inside and outside the classroom for the Brock & surrounding communities."
  },
  {
   "name": "Rehabilitation Science Association",
   "club_contact": "brockurehabscience@gmail.com",
   "club_description": "The Rehabilitation Science Association (RSA) brings together students interested in learning more about careers and professional programs in rehabilitation science. We aim to provide students with valuable knowledge about program application processes and careers through informational sessions, guest speaker nights, and mock CASPer test workshops to prepare students for their future goals."
  },
  {
   "name": "Relay for Life",
   "club_contact": "brockrelayforlife@gmail.com",
   "club_description": "Relay for Life is the largest post-secondary fundraiser in support of the Canadian Cancer Society across the country. Brock Relay for Life hosts smaller fundraising events throughout the year, leading up to the main event hosted at Brock in March. This year due to COVID-19 we will be hosting a virtual event to bring students and the community together and support the Canadian Cancer Society as they are looking at an $80 million deficit. Let’s all do out part because together we are bigger than cancer!"
  },
  {
   "name": "Run Club",
   "club_contact": "brockrunclub@gmail.com",
   "club_description": "We are a community of runners at Brock. If you are a professional athlete or someone who is planning to start their first run, the BRC is the place for you. with plenty of challenges, events and activities; BRC is the club for you! join to be BRC STRONG"
  },
  {
   "name": "Senior Ties",
   "club_contact": "brockseniorties@gmail.com",
   "club_description": "The overall goal of this club is to improve the last chapter of these seniors lives, in any way we can, with a focus on retirement homes. Some volunteer opportunities may include 1-on-1 visits with the residents, helping out at the tuck shop, or assisting with planned activities."
  },
  {
   "name": "Shinerama",
   "club_contact": "brockushinerama@gmail.com",
   "club_description": "Shinerama is Canada’s largest post-secondary fundraiser in support of Cystic Fibrosis Canada. Over 35,000 student volunteers from about 40 Canadian universities and colleges across the country come together every year to make a difference in the lives of those battling cystic fibrosis (CF). Student volunteers all over Canada are shining shoes, flipping burgers, washing cars and doing whatever it takes to raise crucial funding to fight cystic fibrosis. This national movement puts the “fun” in fundraising!"
  },
  {
   "name": "Sikh Students' Association",
   "club_contact": "brocksikhstudentassociation@gmail.com",
   "club_description": "Safe space for all students to learn and discuss Sikhi- expand on issues . To provide an opportunity to meet with professionals in various fields and to discuss their experience as a Sikh. Also, to provide an opportunity for students to meet with like-minded people. To practice ‘Seva’, which means selfless service, within the St. Catharines Community."
  },
  {
   "name": "Smash Club",
   "club_contact": "brockusmash@gmail.com",
   "club_description": "We are a group of Super Smash Bros. series fans that get together every Friday to play, discuss, and compete in Super Smash Bros games. The club is focused on improving player skill as well as providing a rich community experience."
  },
  {
   "name": "STEMSource",
   "club_contact": "stemsourcebrock@gmail.com",
   "club_description": "STEMSource serves to educate and offer introductory knowledge into particular STEM fields\nWe will do this by focusing on different career subsets through panel meetings- professionals will offer direct insight into their experiences in their field and guidance for students who are trying to find their niche in STEM.\nOur main goal is to provide an easily accessible resource for career development. We aim to promote inclusivity and diversity by acknowledging the challenges faced by minorities in STEM; incorporating panellists of varying cultures, beliefs, races, sexualities, and gender will offer career insights from varying perspectives.\nThe club will also provide academic guidance through mock exam tutor sessions for introductory math and science courses."
  },
  {
   "name": "Sociology and Criminology Student Association",
   "club_contact": "scsabrocku@gmail.com",
   "club_description": "The SCSA is founded on the principles of community building, activism and advocacy. We want to encourage discussion: to create safe spaces, to build connections, and to contribute to an ever-growing community."
  },
  {
   "name": "South Asian Women's Society",
   "club_contact": "sawsbrocku@gmail.com",
   "club_description": "The South Asian women's society aims to create a safe space for women to congregate, express themselves and grow both spiritually and academically. We want to ensure that the growing population of South Asian women at Brock are well-represented and feel a sense of community. Our aim is to unify and support the South Asian women who may feel marginalized at Brock in order for them to unleash their full potential. We plan to advocate for this group by organizing workshops, professional development seminars, and having discussions about topics that are not often discussed in South Asian spaces. Most importantly, we hope to have enjoyable events that will enrich students' university experience!"
  },
  {
   "name": "Space and Platentary Exploration (SPEC)",
   "club_contact": "SPEC@brocku.ca",
   "club_description": "A club dedicated to the interest, research, and discovery of planetary and space exploration."
  },
  {
   "name": "Brock Sport and Business Association",
   "club_contact": "brocksba.info@gmail.com",
   "club_description": "The Brock Sport & Business Association (Brock SBA) aims to help Brock University students apply their studies to the world of sports. The purpose of Brock SBA is based on four main points:"
  },
  {
   "name": "Sport Helps Everyone Make Allies",
   "club_contact": "shema.brocku@gmail.com",
   "club_description": "SHEMA is dedicated to fostering a culture of inclusivity and diversity in the Sport Management program at Brock University. By connecting students with peers to create a more inclusive community, we offer a space for students to learn new perspectives. We wish to to inform and empower all students to take their own unique pathway to flourish in the Sport Management Industry."
  },
  {
   "name": "Sport Management Council",
   "club_contact": "brock.spmacouncil@gmail.com",
   "club_description": "The Brock University Sport Management Council is a student-run organization fostering relationships with students, alumni, and faculty. We cultivate positive sport management and professional development experiences by creating unique opportunities inspires by our passion for sport. The Brock Sport Management Council is made up of talented and passionate students from all four years of the Sport Management Program."
  },
  {
   "name": "Sri Lankan Student Association",
   "club_contact": "brockuslsa@gmail.com",
   "club_description": "Sri Lankan Student Association is a student-run organization run at Brock University. We encourage friendship, goodwill, peace, and unity among individuals to promote the culture and traditions of all ethnicities in Sri Lanka. We generate funds through events to help charities and those in need in Sri Lanka. We want to truly make a difference and want to have a huge impact on the Sri Lankan society. We welcome and support all individuals that bring positive outlooks and ideas. We will hold amazing events, which will not only benefit you but the people in need in Sri Lanka"
  },
  {
   "name": "Stem Cell Club",
   "club_contact": "brockstemcellclub@gmail.com",
   "club_description": "Brock Stem Cell Club is a collaboration between Brock undergraduate students and McMaster medical students to increase the number of stem cell donors within the Candian database. Members take part in planning and hosting donor drives on campus to reach out to Brock students. The club also emphasizes the importance of blood donation and aims to increase the number of blood donors on campus."
  },
  {
   "name": "Student Hikers",
   "club_contact": "brocku.bush@gmail.com",
   "club_description": "BUSH is a club dedicated to gathering Brock students around one common interest: hiking. The science is all there. Hiking is beneficial for your physical, mental, and spiritual health. It's also just a lot of fun. If you're interested in getting outside and taking in everything that nature has to offer, then don't be afraid to get in contact with us! We host hikes of all lengths and difficulties so there is no need to worry about your experience level. We hope to see you out there. Happy trails!"
  },
  {
   "name": "Tamil Student Association",
   "club_contact": "tsabrocku@gmail.com",
   "club_description": "This club is an association where our community can come together as one. It's an open environment for Tamil students to freely get together, but not limited to just Tamil students. BTSA celebrates several events for the benefits of Brock Tamils such as Tamil Heritage Month, Tamil New Years, and more."
  },
  {
   "name": "Vietnamese Students' Association",
   "club_contact": "brockunivsa@gmail.com",
   "club_description": "The Brock Vietnamese Students Association - BVSA, is a non profit organization\nfounded in 2018. Since then, the BVSA has promoted and preserved Vietnamese culture\nby hosting many different events during the school term: Orientation Week, Pho Night,\nInternational Week, Tet Holiday, Vietnam In Your Eyes, and Giving away free masks. As\na Vietnamese Students Association of Brock University, BVSA mission to spread out\nthe Vietnamese culture to Brock students and Niagara Community."
  },
  {
   "name": "Brock University Vinyl Society",
   "club_contact": "brockuvinylsociety@gmail.com",
   "club_description": "The Brock University Vinyl society is a club open to all music enthusiasts and is happily welcoming towards listeners of any genre. The premise of the club is to establish a community of fellow Brock students with not only a passion for vinyl records but for music as well."
  },
  {
   "name": "Westmarches",
   "club_contact": "brockwestmarches@outlook.com",
   "club_description": "Brock Westmarches club is a place for people interested in table top role-playing games to learn, play and experience Dungeons and Dragons in a shared fictional world hosted weekly. The club focuses on teaching new comers how to play Dungeons and Dragons and learn useful skills about the hobby such as miniature polishing and painting, character writing, and world-building."
  },
  {
   "name": "Brock Women in Msedicine",
   "club_contact": "brockwim@outlook.com",
   "club_description": "Brock Women in Medicine is a club focused on the empowerment of young women, who are soon to be the leaders in our health care system. Our goal is to support our members through mentorship, educational resources, and volunteer opportunities- with a mission of tackling the lack of diversity in medicine."
  },
  {
   "name": "Brock Women's Health Club",
   "club_contact": "brockwomenshealth@gmail.com",
   "club_description": "The Brock Women's Health club aims to educate and unite all members of the community about the diverse and underrepresented issues women face. We hope to educate members of the community on the mental, reproductive and physical health of women through guest speakers from the community and various group activities. We also aim to support local female health-related organizations within the community by fundraising and donating to women who may lack essential resources. Our club is focused on uniting and educating women and anyone with an interest in the Brock community, on the various aspects of female health."
  },
  {
   "name": "Brock Young Liberals",
   "club_contact": "brockyounglibs@gmail.com",
   "club_description": "Brock Young Liberals is the Brock University chapter of the Young leberals of Canada and the Ontario Young Liberals."
  }]
